dogen/papers.org
#+title: MDE Papers
#+author: Marco Craveiro
#+options: author:nil
#+bind: org-html-validation-link nil
#+HTML_HEAD: <link rel="stylesheet" href="../css/tufte.css" type="text/css" />

[[file:../index.org][Back to home page]].

Listing of papers I have read, and the notes I made. Most of the notes
use [[https://github.com/jkitchin/org-ref][org-ref]] so that I can refer back to the page where they were made.

* Systems variability modeling : a textual model mixing class and feature concepts
  :PROPERTIES:
  :NOTER_DOCUMENT: papers/Systems Variability Modeling: A Textual Model Mixing Class and Feature Concepts.pdf
  :END:

- Younis, Ola, Said Ghoul, and Mohammad H. Alomari.
- "Systems variability modeling: a textual model mixing class and
  feature concepts."
- [[https://arxiv.org/abs/1311.3243][arXiv preprint arXiv:1311.3243 (2013)]].

** Variability: separated approach
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.37154989384288745)
   :END:

The approach of having variability separate from regular modeling is
called the "separated approach".

