dogen/papers.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-28 Sun 11:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MDE Papers</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="../css/tufte.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">MDE Papers</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc2cf5f4">1. Systems variability modeling : a textual model mixing class and feature concepts</a>
<ul>
<li><a href="#org6278547">1.1. Variability: separated approach</a></li>
<li><a href="#org550a075">1.2. Textual notation and mixing</a></li>
<li><a href="#orge177345">1.3. Features as conceptual elements</a></li>
<li><a href="#orgb2b58a6">1.4. Product line steps</a></li>
<li><a href="#orgd21fd3f">1.5. Core assets</a></li>
<li><a href="#org9db32ad">1.6. Feature model use in MASD</a></li>
<li><a href="#org6022585">1.7. Mixing</a></li>
<li><a href="#orgb99e7f9">1.8. Feature selection</a></li>
<li><a href="#orgf2d2c4d">1.9. Complexity in configurations step</a></li>
<li><a href="#org5a305c8">1.10. Bridge between product line design and OO</a></li>
<li><a href="#org3da7625">1.11. CLAFER mixing</a></li>
<li><a href="#orgfc6194d">1.12. OOFM: Sarinho and Apolonario</a></li>
<li><a href="#org7fe40c5">1.13. ECORE feature model</a></li>
<li><a href="#orgd218188">1.14. Implementation models</a></li>
<li><a href="#org1fdd6c7">1.15. Conceptual model components</a></li>
<li><a href="#org4484dc4">1.16. TDM components</a></li>
<li><a href="#org41d0fa9">1.17. Meta-Features Model</a></li>
<li><a href="#org9fd5843">1.18. Features Meta-Model</a></li>
<li><a href="#org14df180">1.19. Application Areas</a></li>
<li><a href="#orgb322fcc">1.20. TDM has strong typing</a></li>
<li><a href="#org354ed57">1.21. TDM methodology</a></li>
<li><a href="#orgf174f3c">1.22. Conclusions</a></li>
</ul>
</li>
<li><a href="#orga7bfa29">2. A Code Generation Metamodel for ULF-Ware Generating Code for SDL and Interfacing with the Runtime Library</a>
<ul>
<li><a href="#orgbafcd5e">2.1. Intermediate model</a></li>
<li><a href="#org30ad9a8">2.2. Generality and Behaviour</a></li>
<li><a href="#org5697f97">2.3. Need for behaviour</a></li>
<li><a href="#orgae42e86">2.4. Decreasing complexity by shared meta-model</a></li>
<li><a href="#org1f56ac2">2.5. MOF</a></li>
<li><a href="#org17e90fa">2.6. Difficulties in generation</a></li>
<li><a href="#orgdc7b658">2.7. Model abstraction level is key</a></li>
<li><a href="#org1d09ca5">2.8. Commonalities for OO</a></li>
<li><a href="#org088ef1f">2.9. Multi-language and common denominators</a></li>
<li><a href="#org1c29c65">2.10. Low-level approach</a></li>
<li><a href="#orgf8cfac7">2.11. Too much detail</a></li>
<li><a href="#org1de1da6">2.12. UML Infrastructure</a></li>
<li><a href="#org289b59c">2.13. Handling of primitives</a></li>
<li><a href="#orga837c6b">2.14. Uniform interfaces to collections</a></li>
<li><a href="#orgffea59a">2.15. Function modeling</a></li>
<li><a href="#org294ade7">2.16. Predefined issues</a></li>
<li><a href="#org6882381">2.17. References</a></li>
</ul>
</li>
<li><a href="#org35cdb64">3. A Lightweight MDSD Process Applied in Small Projects</a>
<ul>
<li><a href="#org7d050c4">3.1. Important success factors</a></li>
<li><a href="#orgddca790">3.2. Range of tooling in MDE is vast</a></li>
<li><a href="#org2a2ee1e">3.3. pragmatic approach</a></li>
<li><a href="#orge8219a6">3.4. Target is small projects</a></li>
<li><a href="#orgc0d27af">3.5. Requirments</a></li>
<li><a href="#orgc2a9dc0">3.6. Activities</a></li>
<li><a href="#org945de10">3.7. MDE develppment process</a></li>
<li><a href="#org0511255">3.8. Template development</a></li>
<li><a href="#orgbafe66c">3.9. Bibliography</a></li>
</ul>
</li>
<li><a href="#orgedbd937">4. Proceso de Desarrollo de Software Mediante Herramientas MDA</a></li>
<li><a href="#org50f1446">5. Un estudio comparativo de dos herramientas MDA: OptimalJ y ArcStyler</a>
<ul>
<li><a href="#org58a6923">5.1. Important factors</a></li>
<li><a href="#org32fce9c">5.2. MDA principles</a></li>
<li><a href="#orgb7a182a">5.3. Model compiler</a></li>
<li><a href="#org8233a65">5.4. Evaluation properties</a></li>
<li><a href="#orgc786bc3">5.5. OptimalJ: Three types of models</a></li>
<li><a href="#org1f2290b">5.6. OptimalJ: Pattern types</a></li>
<li><a href="#orgdcf086d">5.7. OptimalJ: Protected regions</a></li>
<li><a href="#orgd85c4cb">5.8. ArcStyler: Cartridges</a></li>
<li><a href="#orged840af">5.9. Focus on design patterns</a></li>
<li><a href="#orgb4ccef8">5.10. Tradeoffs between integration and extensibility</a></li>
<li><a href="#orgdc2bc60">5.11. Tracing</a></li>
<li><a href="#orgc12fdf0">5.12. Bibliography</a></li>
</ul>
</li>
<li><a href="#org921feec">6. An EMF-like UML generator for C++</a>
<ul>
<li><a href="#org162bcfd">6.1. objectives</a></li>
<li><a href="#orgf86e87b">6.2. unification</a></li>
<li><a href="#orgf9b5d18">6.3. Java is the only first-class citizen of EMF</a></li>
<li><a href="#org9980595">6.4. Workflow</a></li>
<li><a href="#org97929e3">6.5. Annotations</a></li>
<li><a href="#org216d4b9">6.6. Two-generator approach</a></li>
<li><a href="#org6183535">6.7. Reflection</a></li>
<li><a href="#orga1baf76">6.8. UML OpaqueBehaviour</a></li>
<li><a href="#orgd053bcb">6.9. Memory management</a></li>
<li><a href="#org9487012">6.10. Benchmark</a></li>
<li><a href="#org836aa80">6.11. Bibliography</a></li>
</ul>
</li>
<li><a href="#org591c2b6">7. An Abstraction for Reusable MDD Components</a>
<ul>
<li><a href="#orgb2bb8c4">7.1. Gist of the approach</a></li>
<li><a href="#orgaba521b">7.2. Code patterns</a></li>
<li><a href="#orgcb70dea">7.3. QVT default merging strategy</a></li>
<li><a href="#org8f888d3">7.4. Building block</a></li>
<li><a href="#orgafbe6d0">7.5. Audit building block</a></li>
<li><a href="#org3ab320a">7.6. Issues with building blocks</a></li>
<li><a href="#org7fa00e6">7.7. Bibliography</a></li>
</ul>
</li>
<li><a href="#orgcf2eec6">8. Architecture-Centric Model-Driven Web Engineering</a>
<ul>
<li><a href="#org55824b1">8.1. AC-MDSD focuses on infrastructural code</a></li>
<li><a href="#orga74cbe7">8.2. Advantages of MDE for web apps</a></li>
<li><a href="#org0cf5855">8.3. Reference implementation driven approach</a></li>
<li><a href="#org766b043">8.4. White box and black box CASE tools</a></li>
<li><a href="#orged25322">8.5. Related work</a></li>
<li><a href="#orgf2dab26">8.6. Graphical vs Textual</a></li>
<li><a href="#orge022bf8">8.7. DDD Entity pattern and manager (service)</a></li>
<li><a href="#org1380f53">8.8. Two-track development approach</a></li>
<li><a href="#org0a17872">8.9. AC-MDSD approach with regards to extensibility</a></li>
<li><a href="#orge707e8e">8.10. Bibliography</a></li>
</ul>
</li>
<li><a href="#org0eb6ac2">9. A UML Profile for Feature Diagrams: Initiating a Model Driven Engineering Approach for Software Product Lines</a>
<ul>
<li><a href="#org04fb858">9.1. Objective is full lifecycle</a></li>
<li><a href="#orgf8673d8">9.2. Feature model elements</a></li>
<li><a href="#org281083e">9.3. Sub-features</a></li>
<li><a href="#orgb16de8e">9.4. UML Component as a feature</a></li>
<li><a href="#org6cc8fc5">9.5. Model-relationship</a></li>
<li><a href="#org133e178">9.6. Bibliography</a></li>
</ul>
</li>
<li><a href="#orge583ced">10. Generic Modeling using UML extensions for variability</a>
<ul>
<li><a href="#orgf511238">10.1. Feature models target end users</a></li>
<li><a href="#org43dcfe5">10.2. Instantiation of models into products</a></li>
<li><a href="#orgcaea277">10.3. Variation points</a></li>
<li><a href="#orga99a027">10.4. Generic models from Domain Engineering</a></li>
<li><a href="#org6f9825e">10.5. Hiding of less important information</a></li>
<li><a href="#orgd0cb071">10.6. Variation points</a></li>
<li><a href="#org485a1b2">10.7. Model evolution</a></li>
<li><a href="#orgc9d7412">10.8. Variation points and JSON</a></li>
<li><a href="#org25828b4">10.9. Binding times</a></li>
<li><a href="#org1bdedac">10.10. Variability at the model element level</a></li>
<li><a href="#org48b6881">10.11. Bibliography</a></li>
</ul>
</li>
<li><a href="#orgf2a85ba">11. Using Aspects to Model Product Line Variability</a>
<ul>
<li><a href="#orgb707bda">11.1. Product line engineering</a></li>
<li><a href="#orgb6277fe">11.2. MDSD and AOSD</a></li>
<li><a href="#orge0677c8">11.3. Domain Engineering / Application Engineering</a></li>
<li><a href="#orgded5de9">11.4. Model-level weaving</a></li>
<li><a href="#org032de65">11.5. Aspects for variability increases flexibility</a></li>
<li><a href="#org7089e94">11.6. Comparison between our approach and aspects</a></li>
</ul>
</li>
<li><a href="#org1d79f1b">12. A flexible code generator for MOF-based modeling languages</a>
<ul>
<li><a href="#org60fc56d">12.1. MOmoC</a></li>
<li><a href="#org183518c">12.2. Model compiler</a></li>
<li><a href="#orgf184bfa">12.3. MOmoC architecture</a></li>
</ul>
</li>
<li><a href="#orge6369a8">13. A Comparison of Generative Approaches: XVCL and GenVoca</a>
<ul>
<li><a href="#orge6d1c78">13.1. Compositional Design</a></li>
<li><a href="#org0bf3762">13.2. References</a></li>
</ul>
</li>
<li><a href="#org249633f">14. An evaluation of the Graphical Modeling Framework GMF based on the development of the CORAS tool</a>
<ul>
<li><a href="#orgb791770">14.1. Tagging in GMF</a></li>
<li><a href="#org14f462b">14.2. Packaging issues</a></li>
<li><a href="#org80df858">14.3. Avoid human interactions in generations</a></li>
</ul>
</li>
<li><a href="#orgad8d414">15. Features as transformations: A generative approach to software development</a>
<ul>
<li><a href="#org3242519">15.1. Feature selection</a></li>
<li><a href="#orgb511593">15.2. Feature interaction</a></li>
<li><a href="#orgbef6a51">15.3. Classification of transforms</a></li>
</ul>
</li>
<li><a href="#orgf3daf4f">16. Translating Alloy Specifications to UML Class Diagrams Annotated with OCL</a></li>
<li><a href="#orgd0d9885">17. Agile MDA</a></li>
<li><a href="#org43c929e">18. Model-driven Development of Complex Software: A Research Roadmap</a></li>
<li><a href="#org53e5e9e">19. A meta-model for language-independent refactoring</a></li>
<li><a href="#org3731310">20. Metrics on Feature Models to Optimise Configuration Adaptation at Runtime</a></li>
<li><a href="#org0d1d224">21. A UML profile for feature diagrams</a></li>
<li><a href="#orgb30eb43">22. AndroMDA</a></li>
<li><a href="#orgd1d12ee">23. Construction and Evolution of Code Generators</a></li>
<li><a href="#org3e46640">24. Bridging the Gap Between Features and Models</a></li>
<li><a href="#org5ba685c">25. Generating Aspect Code from UML Models</a></li>
<li><a href="#orgcc6372e">26. State of the art of QVT: a model transformation language standard</a></li>
<li><a href="#org2e957db">27. Generative Programming Using Frame Technology</a></li>
<li><a href="#org5c80c1a">28. Ecore.Fmp: A Tool For Editing And Instantiating Class Models As Feature Models</a></li>
<li><a href="#orge3e4326">29. Towards Separation of Concerns in Model Transformation Workflows</a></li>
<li><a href="#orgea94e0e">30. Classification of Model Transformation Approaches</a></li>
<li><a href="#org3673db9">31. Feature-Based Survey of Model Transformation Approaches</a></li>
<li><a href="#orgde1a2f8">32. Software Diversity: State of the Art and Perspectives</a></li>
<li><a href="#orgeb9a9c5">33. Variability in Software Architecture: Current Practices and Challenges</a></li>
<li><a href="#org3d685dc">34. Systems Variability Modeling: A Textual Model Mixing Class and Feature Concepts</a></li>
<li><a href="#org517da62">35. A Common Metamodel for Code Generation</a></li>
<li><a href="#orgb1293bd">36. A Code Generation Metamodel for ULF-Ware</a></li>
<li><a href="#org9c7046c">37. Aspect-Oriented Model-Driven Software Product Line Engineering</a>
<ul>
<li><a href="#orgdd7f25a">37.1. Expressing Variability in Structural Models</a></li>
<li><a href="#orgd39acba">37.2. Expressing Variability in Model Transformations</a></li>
<li><a href="#orgd9c4595">37.3. Expressing Variability in Code Generation Templates</a></li>
<li><a href="#orgc4b0db3">37.4. Expressing Variability in Code</a></li>
<li><a href="#org24e6bbd">37.5. Home Automation Case Study</a></li>
<li><a href="#orgc6036a3">37.6. Conclusions</a></li>
</ul>
</li>
<li><a href="#orgdc4f6cb">38. An Aspect-Oriented and Model-Driven Approach for Managing Dynamic Variability</a></li>
<li><a href="#org8ae7f29">39. A Feature Model for Model-to-Text Transformation Languages</a>
<ul>
<li><a href="#org3f4cc46">39.1. Abstract</a></li>
<li><a href="#org79c910a">39.2. Introduction</a></li>
<li><a href="#org297aa12">39.3. A Feature Model for M2T Languages</a></li>
</ul>
</li>
<li><a href="#org5f1a27b">40. Modeling Variability in Template-based Code Generators for Product Line Engineering</a>
<ul>
<li><a href="#orgf775cf6">40.1. Abstract</a></li>
<li><a href="#org3390b34">40.2. Introduction</a></li>
<li><a href="#org8576a0b">40.3. Variability Concepts in Code Generator Product Lines</a></li>
<li><a href="#orgec61f0f">40.4. Code Generator Variant Configuration and Generation</a></li>
<li><a href="#org5bd4da5">40.5. Demonstrating Example for Variability Regions</a></li>
<li><a href="#org752cdc6">40.6. Industrial Case Study</a></li>
<li><a href="#org1ed7d14">40.7. Related Work</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="../index.html">Back to home page</a>.
</p>

<p>
Listing of papers I have read, and the notes I made. Most of the notes
use <a href="https://github.com/jkitchin/org-ref">org-ref</a> so that I can refer back to the page where they were made.
</p>

<div id="outline-container-orgc2cf5f4" class="outline-2">
<h2 id="orgc2cf5f4"><span class="section-number-2">1</span> Systems variability modeling : a textual model mixing class and feature concepts</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Younis, Ola, Said Ghoul, and Mohammad H. Alomari.</li>
<li>"Systems variability modeling: a textual model mixing class and
feature concepts."</li>
<li><a href="https://arxiv.org/abs/1311.3243">arXiv preprint arXiv:1311.3243 (2013)</a>.</li>
</ul>
</div>

<div id="outline-container-org6278547" class="outline-3">
<h3 id="org6278547"><span class="section-number-3">1.1</span> Variability: separated approach</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The approach of having variability separate from regular modeling is
called the "separated approach".
</p>
</div>
</div>
