dogen/papers.org
** Textual notation and mixing
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.41401273885350315)
   :END:

Author claims that textual notations do not provide "integrated"
management of both modeling and variability, e.g. follow the separated
approach.

The opposite of the separate approach is "mixing", where we mix
classes and features.

** Features as conceptual elements
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.41401273885350315)
   :END:

In the author's view features are conceptual elements whereas regular
modeling is physical. We take the view that regular modeling is a
conceptual concept and the physical layer lies in the realm of files
and directories.

** Product line steps
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.6794055201698513)
   :END:

The idea that there are several steps in the the design and
implementation of a software product. The smaller the number of steps
the better. We should make clear what these steps are in MASD.

** Core assets
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.6900212314225053)
   :END:

From a MASD perspective, the catalog of schematic and repetitive
patterns is the set of reusable core assets, not the meta-model
elements. We need to make this clear in the conceptual model.

** Feature model use in MASD
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.7749469214437367)
   :END:

Unlike regular MDE approaches, in MASD we do not allow users to create
their own feature models for their particular problem domain (what the
author calls the domain space). Instead, users can make /selections/
over the MASD feature model, defining what features are required for
the product in question. However, users cannot redefine the feature
model, only instantiate it.

We should make sure we explain that there are two different views on
variability, depending on whether we are Dogen Developers or Dogen
Users.

** Mixing
   :PROPERTIES:
   :NOTER_PAGE: (2 . 0.21231422505307854)
   :END:

Author seems to claim that having a feature model and a class model
separately, and subsequently mixing the two to obtain the SPL product
is still part of the mixed approach. There are several techniques to
perform the mixing:

- constraint additions
- relation definition
- reference links

** Feature selection
   :PROPERTIES:
   :NOTER_PAGE: (2 . 0.24416135881104034)
   :END:

The process of feature selection involves resolving constraints
amongst features. Interesting term "fixed features". This seems to
describe the MASD approach well.

** Complexity in configurations step
   :PROPERTIES:
   :NOTER_PAGE: (2 . 0.5307855626326964)
   :END:

In proper SPL products that make use of feature models, the mixing of
feature models and class diagrams creates a lot of complexity. In
particular, the selection of features and its impact on the class
models is very important. If the process for mixing is too complex,
users will not be able to make use of this approach. MASD takes a very
simplistic view, defining a very simple feature model in order to
tackle this problem.

** Bridge between product line design and OO
   :PROPERTIES:
   :NOTER_PAGE: (2 . 0.6369426751592356)
   :END:

MASD provides a bridge between these two distinct worlds, but the
bridge is very narrow in order to keep the complexity down. The MASD
model has a small number of concepts:

#+begin_quote
Provide a new concise and rich textual notation for feature modeling
and class modeling. It allows simple and natural new way of mixing
feature models and class models using small number of concepts.
#+end_quote

Requirements for a solution:

- the mixing solution should be both concise and rich.
- simple, coherent, and complete configuration generation

** CLAFER mixing
   :PROPERTIES:
   :NOTER_PAGE: (3 . 0.8174097664543524)
   :END:

The approach used by CLAFER for their mixing is interesting. It is
based on constraints and inheritance. The FM is a collection of type
definitions and features and it is joined with the class model as
attributes and attribute values. We need to read up on CLAFER.

** OOFM: Sarinho and Apolonario
   :PROPERTIES:
   :NOTER_PAGE: (4 . 0.2653927813163482)
   :END:

Interesting paper to read: V. T. Sarinho and A. L. Apolinario (2010),
“Combining feature modeling and Object Oriented concepts to manage the
software variability”, IEEE International Conference on Information
Reuse and Integration (IRI), pp. 344-349.

** ECORE feature model
   :PROPERTIES:
   :NOTER_PAGE: (4 . 0.4564755838641189)
   :END:

M. Stephan and M. Antkiewicz (2008), “Ecore.fmp: A tool for editing
and instantiating class models as feature models”, University of
Waterloo, Waterloo, Technical Report.

** Implementation models
   :PROPERTIES:
   :NOTER_PAGE: (4 . 0.6581740976645435)
   :END:

MASD focuses solely on implementation models.

** Conceptual model components
   :PROPERTIES:
   :NOTER_PAGE: (5 . 0.13800424628450106)
   :END:

- feature concepts;
- object-oriented concepts;
- rules for mixing classes and features.

** TDM components
   :PROPERTIES:
   :NOTER_PAGE: (5 . 0.5414012738853503)
   :END:

Composed of four feature modules:

- Features types: "This feature module captures all features in the
  system with their possible values. It is composed by Features_Types
  and Relation_Types."
- Features Global: "This feature module specifies the Global features
  that will be shared between all system components."
- Features Control: "This feature module is composed by relations only,
  and its main goal is to keep systems’ components stable and avoid
  any conflicts."
- Features Configuration: "This feature module is composed by
  relations only, and its main goal is to keep systems’ components
  stable and avoid any conflicts."

** Meta-Features Model
   :PROPERTIES:
   :NOTER_PAGE: (5 . 0.6263269639065817)
   :END:

Models all features in TDM, template for feaures in the Features
Meta-Model. Seems like a Meta-Meta-Model.

** Features Meta-Model
   :PROPERTIES:
   :NOTER_PAGE: (6 . 0.16985138004246284)
   :END:

Based on the MFM. "This is an intermediate model between the
conceptual part (Feature Meta-Model) and the physical part (Product
Model).

** Application Areas
   :PROPERTIES:
   :NOTER_PAGE: (11 . 0.25477707006369427)
   :END:

Provide a list of specific use cases that can benefit from MASD with
examples.

** TDM has strong typing
   :PROPERTIES:
   :NOTER_PAGE: (11 . 0.5095541401273885)
   :END:

The TDM approach of having strong types for features is similar to our
approach in that the features meta-model defines the domain of
instantiation for all types used in configuration.

