dogen/papers.html

<div id="outline-container-org550a075" class="outline-3">
<h3 id="org550a075"><span class="section-number-3">1.2</span> Textual notation and mixing</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Author claims that textual notations do not provide "integrated"
management of both modeling and variability, e.g. follow the separated
approach.
</p>

<p>
The opposite of the separate approach is "mixing", where we mix
classes and features.
</p>
</div>
</div>

<div id="outline-container-orge177345" class="outline-3">
<h3 id="orge177345"><span class="section-number-3">1.3</span> Features as conceptual elements</h3>
<div class="outline-text-3" id="text-1-3">
<p>
In the author's view features are conceptual elements whereas regular
modeling is physical. We take the view that regular modeling is a
conceptual concept and the physical layer lies in the realm of files
and directories.
</p>
</div>
</div>

<div id="outline-container-orgb2b58a6" class="outline-3">
<h3 id="orgb2b58a6"><span class="section-number-3">1.4</span> Product line steps</h3>
<div class="outline-text-3" id="text-1-4">
<p>
The idea that there are several steps in the the design and
implementation of a software product. The smaller the number of steps
the better. We should make clear what these steps are in MASD.
</p>
</div>
</div>

<div id="outline-container-orgd21fd3f" class="outline-3">
<h3 id="orgd21fd3f"><span class="section-number-3">1.5</span> Core assets</h3>
<div class="outline-text-3" id="text-1-5">
<p>
From a MASD perspective, the catalog of schematic and repetitive
patterns is the set of reusable core assets, not the meta-model
elements. We need to make this clear in the conceptual model.
</p>
</div>
</div>

<div id="outline-container-org9db32ad" class="outline-3">
<h3 id="org9db32ad"><span class="section-number-3">1.6</span> Feature model use in MASD</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Unlike regular MDE approaches, in MASD we do not allow users to create
their own feature models for their particular problem domain (what the
author calls the domain space). Instead, users can make <i>selections</i>
over the MASD feature model, defining what features are required for
the product in question. However, users cannot redefine the feature
model, only instantiate it.
</p>

<p>
We should make sure we explain that there are two different views on
variability, depending on whether we are Dogen Developers or Dogen
Users.
</p>
</div>
</div>

<div id="outline-container-org6022585" class="outline-3">
<h3 id="org6022585"><span class="section-number-3">1.7</span> Mixing</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Author seems to claim that having a feature model and a class model
separately, and subsequently mixing the two to obtain the SPL product
is still part of the mixed approach. There are several techniques to
perform the mixing:
</p>

<ul class="org-ul">
<li>constraint additions</li>
<li>relation definition</li>
<li>reference links</li>
</ul>
</div>
</div>

<div id="outline-container-orgb99e7f9" class="outline-3">
<h3 id="orgb99e7f9"><span class="section-number-3">1.8</span> Feature selection</h3>
<div class="outline-text-3" id="text-1-8">
<p>
The process of feature selection involves resolving constraints
amongst features. Interesting term "fixed features". This seems to
describe the MASD approach well.
</p>
</div>
</div>

<div id="outline-container-orgf2d2c4d" class="outline-3">
<h3 id="orgf2d2c4d"><span class="section-number-3">1.9</span> Complexity in configurations step</h3>
<div class="outline-text-3" id="text-1-9">
<p>
In proper SPL products that make use of feature models, the mixing of
feature models and class diagrams creates a lot of complexity. In
particular, the selection of features and its impact on the class
models is very important. If the process for mixing is too complex,
users will not be able to make use of this approach. MASD takes a very
simplistic view, defining a very simple feature model in order to
tackle this problem.
</p>
</div>
</div>

<div id="outline-container-org5a305c8" class="outline-3">
<h3 id="org5a305c8"><span class="section-number-3">1.10</span> Bridge between product line design and OO</h3>
<div class="outline-text-3" id="text-1-10">
<p>
MASD provides a bridge between these two distinct worlds, but the
bridge is very narrow in order to keep the complexity down. The MASD
model has a small number of concepts:
</p>

<div class="epigraph"><blockquote>
<p>
Provide a new concise and rich textual notation for feature modeling
and class modeling. It allows simple and natural new way of mixing
feature models and class models using small number of concepts.
</p>

</blockquote></div>

<p>
Requirements for a solution:
</p>

<ul class="org-ul">
<li>the mixing solution should be both concise and rich.</li>
<li>simple, coherent, and complete configuration generation</li>
</ul>
</div>
</div>

<div id="outline-container-org3da7625" class="outline-3">
<h3 id="org3da7625"><span class="section-number-3">1.11</span> CLAFER mixing</h3>
<div class="outline-text-3" id="text-1-11">
<p>
The approach used by CLAFER for their mixing is interesting. It is
based on constraints and inheritance. The FM is a collection of type
definitions and features and it is joined with the class model as
attributes and attribute values. We need to read up on CLAFER.
</p>
</div>
</div>

<div id="outline-container-orgfc6194d" class="outline-3">
<h3 id="orgfc6194d"><span class="section-number-3">1.12</span> OOFM: Sarinho and Apolonario</h3>
<div class="outline-text-3" id="text-1-12">
<p>
Interesting paper to read: V. T. Sarinho and A. L. Apolinario (2010),
“Combining feature modeling and Object Oriented concepts to manage the
software variability”, IEEE International Conference on Information
Reuse and Integration (IRI), pp. 344-349.
</p>
</div>
</div>

<div id="outline-container-org7fe40c5" class="outline-3">
<h3 id="org7fe40c5"><span class="section-number-3">1.13</span> ECORE feature model</h3>
<div class="outline-text-3" id="text-1-13">
<p>
M. Stephan and M. Antkiewicz (2008), “Ecore.fmp: A tool for editing
and instantiating class models as feature models”, University of
Waterloo, Waterloo, Technical Report.
</p>
</div>
</div>

<div id="outline-container-orgd218188" class="outline-3">
<h3 id="orgd218188"><span class="section-number-3">1.14</span> Implementation models</h3>
<div class="outline-text-3" id="text-1-14">
<p>
MASD focuses solely on implementation models.
</p>
</div>
</div>

<div id="outline-container-org1fdd6c7" class="outline-3">
<h3 id="org1fdd6c7"><span class="section-number-3">1.15</span> Conceptual model components</h3>
<div class="outline-text-3" id="text-1-15">
<ul class="org-ul">
<li>feature concepts;</li>
<li>object-oriented concepts;</li>
<li>rules for mixing classes and features.</li>
</ul>
</div>
</div>

<div id="outline-container-org4484dc4" class="outline-3">
<h3 id="org4484dc4"><span class="section-number-3">1.16</span> TDM components</h3>
<div class="outline-text-3" id="text-1-16">
<p>
Composed of four feature modules:
</p>

<ul class="org-ul">
<li>Features types: "This feature module captures all features in the
system with their possible values. It is composed by Features<sub>Types</sub>
and Relation<sub>Types</sub>."</li>
<li>Features Global: "This feature module specifies the Global features
that will be shared between all system components."</li>
<li>Features Control: "This feature module is composed by relations only,
and its main goal is to keep systems’ components stable and avoid
any conflicts."</li>
<li>Features Configuration: "This feature module is composed by
relations only, and its main goal is to keep systems’ components
stable and avoid any conflicts."</li>
</ul>
</div>
</div>

<div id="outline-container-org41d0fa9" class="outline-3">
<h3 id="org41d0fa9"><span class="section-number-3">1.17</span> Meta-Features Model</h3>
<div class="outline-text-3" id="text-1-17">
<p>
Models all features in TDM, template for feaures in the Features
Meta-Model. Seems like a Meta-Meta-Model.
</p>
</div>
</div>

<div id="outline-container-org9fd5843" class="outline-3">
<h3 id="org9fd5843"><span class="section-number-3">1.18</span> Features Meta-Model</h3>
<div class="outline-text-3" id="text-1-18">
<p>
Based on the MFM. "This is an intermediate model between the
conceptual part (Feature Meta-Model) and the physical part (Product
Model).
</p>
</div>
</div>

<div id="outline-container-org14df180" class="outline-3">
<h3 id="org14df180"><span class="section-number-3">1.19</span> Application Areas</h3>
<div class="outline-text-3" id="text-1-19">
<p>
Provide a list of specific use cases that can benefit from MASD with
examples.
</p>
</div>
</div>

<div id="outline-container-orgb322fcc" class="outline-3">
<h3 id="orgb322fcc"><span class="section-number-3">1.20</span> TDM has strong typing</h3>
<div class="outline-text-3" id="text-1-20">
<p>
The TDM approach of having strong types for features is similar to our
approach in that the features meta-model defines the domain of
instantiation for all types used in configuration.
</p>
</div>
</div>
