dogen/papers.org
** TDM methodology
   :PROPERTIES:
   :NOTER_PAGE: (11 . 0.7112526539278131)
   :END:

TDM uses feature modeling as part of a wider methodology, guiding its
use. Similarly with MASD, feature modeling is fixed by the methodology
itself, and therefore integrated in the modeling approach.

** Conclusions

Steps:

- from a feature meta-model, we instantiate it by creating features.
-

- features may be of different types. In our case we seem to have
  control features (enablement)


Notes:

- instead of their notion of global features (shared between system
  components) we have features with different binding points: global,
  element, etc.
- we do have a notion of "feature types": we have features that are
  just "input parameters" with values that are read out and used;
  other features such as enablement, produce wider changes.
- we need to explain how our mixing approach fits in with existing
  mixing approaches. Is there a survey of mixing? We need to define a
  methodology for the mixing process.
- the logical model is an OO model. The physical model defines a
  meta-model for the implementation. The variability model defines a
  feature meta-model and model. The product models are instances of
  all of these models.
- we use features for the solution space.
- for us "variant products" has a different meaning. Since we only
  care about SRAPs, to call a MASD product a variant is not very
  meaningful. However, users define families and those have products
  as instances.
- we don't yet solve constraints amongst features. OR: we take an
  empirical approach to features: general statements are hard and
  inflexible so we check for correctness on a case by case basis. This
  is our trade-off.
- our approach is to create a code generation meta-model which exposes
  the smallest amount of MDE concepts to the end user. The end user is
  free to exploit them via existing tooling such as EMF. Our code
  generator is a bridge between regular development and MDE.
- feature models typically focus on problem space. We use them for the
  solution space.
- major disagreement with author: we do not believe text notation is
  better or worse than graphical notation; they have different
  properties and therefore different uses. We'd like to support both.
- taxonomy of features: static, dynamic (feature toggles). For dynamic
  features we need a separate library. Actually, could we use a
  library that handles both? Maybe its just a coincidence that the
  code generator supports its features directly from a model. The
  difference is in the model we have context (global and local
  features).

Summary:

| Aspect              | TDM Approach | MASD Approach |
|---------------------+--------------+---------------|
| Meta-Features model |              | Hard-coded.   |
|                     |              |               |

* A Code Generation Metamodel for ULF-Ware Generating Code for SDL and Interfacing with the Runtime Library
  :PROPERTIES:
  :NOTER_DOCUMENT: papers/A Code Generation Metamodel for ULF-Ware.pdf
  :END:

** Intermediate model
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.40707964601769914)
   :END:

Instead of creating a meta-model that is general and useful for many
use cases, its best to create a meta-model specific for code
generation only.

** Generality and Behaviour
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.45132743362831856)
   :END:

Authors believe that the model should be general in order to support
several target languages, which we agree with, but they also think
behaviour is important - which we disagree.

** Need for behaviour
   :PROPERTIES:
   :NOTER_PAGE: (2 . 0.5232558139534883)
   :END:

Authors claim that a structural-only model is not sufficient, but do
not provide additional justification for their views.

** Decreasing complexity by shared meta-model
   :PROPERTIES:
   :NOTER_PAGE: (2 . 0.6191860465116279)
   :END:

Not clear why authors think we need n * m libraries. But at any rate,
with a shared infrastructure we can manage to significantly reduce
code duplication. We still need language specific PDMs.

** MOF
   :PROPERTIES:
   :NOTER_PAGE: (3 . 0.5319767441860465)
   :END:

The use of a standard meta-meta-model provides a lot of tooling
infrastructure and simplifies the work. We need to justify why we did
not build upon this approach.

** Difficulties in generation
   :PROPERTIES:
   :NOTER_PAGE: (3 . 0.6802325581395349)
   :END:

Authors explain the difficulty of code generation from abstract
models. We should mention our solution to this problem, which is to
capture schematic and repetitive patterns found in code.

** Model abstraction level is key
   :PROPERTIES:
   :NOTER_PAGE: (4 . 0.19186046511627905)
   :END:

Finding the right level of abstraction at which to model is very
important. If a model is too close to source code it is very difficult
to handle in terms of transformations, if it is too far away from
source code, the code generation is very hard.

** Commonalities for OO
   :PROPERTIES:
   :NOTER_PAGE: (4 . 0.313953488372093)
   :END:

Authors make a case for a common model for several OO languages for
code generation.

** Multi-language and common denominators
   :PROPERTIES:
   :NOTER_PAGE: (4 . 0.45348837209302323)
   :END:


By supporting multiple languages, the authors decided that only
features that are common to all languages are supported in the
meta-model. Our approach is to have some features supported on some
languages but not others.

** Low-level approach
   :PROPERTIES:
   :NOTER_PAGE: (4 . 0.6976744186046512)
   :END:

Authors seem to be concerned with low-level language details at code
generation level. We believe instead that much of the massaging
required can be done at the M2T transformation level, and the role of
the PDMs is only when large missing features need to be provided.

** Too much detail
   :PROPERTIES:
   :NOTER_PAGE: (5 . 0.16569767441860464)
   :END:

    As with the right level of modeling, the right level of detail on the
code generator is also an engineering trade off. We decided to add
more detail to the generation in order to keep the meta-model simpler.

Creating a library to make the different OO languages look the same
has a lot of disadvantages:

- a lot of code to maintain.
- non-idiomatic code that developers of that language will not
  understand.

