dogen/papers.html

<div id="outline-container-org354ed57" class="outline-3">
<h3 id="org354ed57"><span class="section-number-3">1.21</span> TDM methodology</h3>
<div class="outline-text-3" id="text-1-21">
<p>
TDM uses feature modeling as part of a wider methodology, guiding its
use. Similarly with MASD, feature modeling is fixed by the methodology
itself, and therefore integrated in the modeling approach.
</p>
</div>
</div>

<div id="outline-container-orgf174f3c" class="outline-3">
<h3 id="orgf174f3c"><span class="section-number-3">1.22</span> Conclusions</h3>
<div class="outline-text-3" id="text-1-22">
<p>
Steps:
</p>

<ul class="org-ul">
<li>from a feature meta-model, we instantiate it by creating features.</li>
<li></li>


<li>features may be of different types. In our case we seem to have
control features (enablement)</li>
</ul>


<p>
Notes:
</p>

<ul class="org-ul">
<li>instead of their notion of global features (shared between system
components) we have features with different binding points: global,
element, etc.</li>
<li>we do have a notion of "feature types": we have features that are
just "input parameters" with values that are read out and used;
other features such as enablement, produce wider changes.</li>
<li>we need to explain how our mixing approach fits in with existing
mixing approaches. Is there a survey of mixing? We need to define a
methodology for the mixing process.</li>
<li>the logical model is an OO model. The physical model defines a
meta-model for the implementation. The variability model defines a
feature meta-model and model. The product models are instances of
all of these models.</li>
<li>we use features for the solution space.</li>
<li>for us "variant products" has a different meaning. Since we only
care about SRAPs, to call a MASD product a variant is not very
meaningful. However, users define families and those have products
as instances.</li>
<li>we don't yet solve constraints amongst features. OR: we take an
empirical approach to features: general statements are hard and
inflexible so we check for correctness on a case by case basis. This
is our trade-off.</li>
<li>our approach is to create a code generation meta-model which exposes
the smallest amount of MDE concepts to the end user. The end user is
free to exploit them via existing tooling such as EMF. Our code
generator is a bridge between regular development and MDE.</li>
<li>feature models typically focus on problem space. We use them for the
solution space.</li>
<li>major disagreement with author: we do not believe text notation is
better or worse than graphical notation; they have different
properties and therefore different uses. We'd like to support both.</li>
<li>taxonomy of features: static, dynamic (feature toggles). For dynamic
features we need a separate library. Actually, could we use a
library that handles both? Maybe its just a coincidence that the
code generator supports its features directly from a model. The
difference is in the model we have context (global and local
features).</li>
</ul>

<p>
Summary:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Aspect</th>
<th scope="col" class="org-left">TDM Approach</th>
<th scope="col" class="org-left">MASD Approach</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Meta-Features model</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Hard-coded.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orga7bfa29" class="outline-2">
<h2 id="orga7bfa29"><span class="section-number-2">2</span> A Code Generation Metamodel for ULF-Ware Generating Code for SDL and Interfacing with the Runtime Library</h2>
<div class="outline-text-2" id="text-2">
</div>

<div id="outline-container-orgbafcd5e" class="outline-3">
<h3 id="orgbafcd5e"><span class="section-number-3">2.1</span> Intermediate model</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Instead of creating a meta-model that is general and useful for many
use cases, its best to create a meta-model specific for code
generation only.
</p>
</div>
</div>

<div id="outline-container-org30ad9a8" class="outline-3">
<h3 id="org30ad9a8"><span class="section-number-3">2.2</span> Generality and Behaviour</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Authors believe that the model should be general in order to support
several target languages, which we agree with, but they also think
behaviour is important - which we disagree.
</p>
</div>
</div>

<div id="outline-container-org5697f97" class="outline-3">
<h3 id="org5697f97"><span class="section-number-3">2.3</span> Need for behaviour</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Authors claim that a structural-only model is not sufficient, but do
not provide additional justification for their views.
</p>
</div>
</div>

<div id="outline-container-orgae42e86" class="outline-3">
<h3 id="orgae42e86"><span class="section-number-3">2.4</span> Decreasing complexity by shared meta-model</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Not clear why authors think we need n * m libraries. But at any rate,
with a shared infrastructure we can manage to significantly reduce
code duplication. We still need language specific PDMs.
</p>
</div>
</div>

<div id="outline-container-org1f56ac2" class="outline-3">
<h3 id="org1f56ac2"><span class="section-number-3">2.5</span> MOF</h3>
<div class="outline-text-3" id="text-2-5">
<p>
The use of a standard meta-meta-model provides a lot of tooling
infrastructure and simplifies the work. We need to justify why we did
not build upon this approach.
</p>
</div>
</div>

<div id="outline-container-org17e90fa" class="outline-3">
<h3 id="org17e90fa"><span class="section-number-3">2.6</span> Difficulties in generation</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Authors explain the difficulty of code generation from abstract
models. We should mention our solution to this problem, which is to
capture schematic and repetitive patterns found in code.
</p>
</div>
</div>

<div id="outline-container-orgdc7b658" class="outline-3">
<h3 id="orgdc7b658"><span class="section-number-3">2.7</span> Model abstraction level is key</h3>
<div class="outline-text-3" id="text-2-7">
<p>
Finding the right level of abstraction at which to model is very
important. If a model is too close to source code it is very difficult
to handle in terms of transformations, if it is too far away from
source code, the code generation is very hard.
</p>
</div>
</div>

<div id="outline-container-org1d09ca5" class="outline-3">
<h3 id="org1d09ca5"><span class="section-number-3">2.8</span> Commonalities for OO</h3>
<div class="outline-text-3" id="text-2-8">
<p>
Authors make a case for a common model for several OO languages for
code generation.
</p>
</div>
</div>

<div id="outline-container-org088ef1f" class="outline-3">
<h3 id="org088ef1f"><span class="section-number-3">2.9</span> Multi-language and common denominators</h3>
<div class="outline-text-3" id="text-2-9">
<p>
By supporting multiple languages, the authors decided that only
features that are common to all languages are supported in the
meta-model. Our approach is to have some features supported on some
languages but not others.
</p>
</div>
</div>

<div id="outline-container-org1c29c65" class="outline-3">
<h3 id="org1c29c65"><span class="section-number-3">2.10</span> Low-level approach</h3>
<div class="outline-text-3" id="text-2-10">
<p>
Authors seem to be concerned with low-level language details at code
generation level. We believe instead that much of the massaging
required can be done at the M2T transformation level, and the role of
the PDMs is only when large missing features need to be provided.
</p>
</div>
</div>

<div id="outline-container-orgf8cfac7" class="outline-3">
<h3 id="orgf8cfac7"><span class="section-number-3">2.11</span> Too much detail</h3>
<div class="outline-text-3" id="text-2-11">
<p>
    As with the right level of modeling, the right level of detail on the
code generator is also an engineering trade off. We decided to add
more detail to the generation in order to keep the meta-model simpler.
</p>

<p>
Creating a library to make the different OO languages look the same
has a lot of disadvantages:
</p>

<ul class="org-ul">
<li>a lot of code to maintain.</li>
<li>non-idiomatic code that developers of that language will not
understand.</li>
</ul>
</div>
</div>
