dogen/papers.org
** UML Infrastructure
   :PROPERTIES:
   :NOTER_PAGE: (5 . 0.7936046511627907)
   :END:

Whilst the authors claim their meta-model is designed for
code-generation, it seems its more concerned with UML compatibility
rather than a close fit to the the requirements of the generator. We
take the exact opposite approach: our model is designed specifically
to fit the code generation requirements.

| CeeJay type | Dogen Type | Comments                                                                          |
|-------------+------------+-----------------------------------------------------------------------------------|
| Package     | Module     | Low-level mapping, forcing all of C++ elements to be declared in the same header. |
| Class       | Object     | No multiple inheritance.                                                          |
|   Types       | N/A        | We use multiple meta-model types for this concept.                                |

** Handling of primitives
   :PROPERTIES:
   :NOTER_PAGE: (7 . 0.19186046511627905)
   :END:

CeeJay expects the existence of a number of "core" types. This is not
enforced formally. Dogen sees these as plain model types, defined in
PDMs. Builtins are no different from any model type.

** Uniform interfaces to collections
   :PROPERTIES:
   :NOTER_PAGE: (7 . 0.27906976744186046)
   :END:

CeeJay's approach of having uniform interfaces to collections is not
ideal because we either duplicate the existing standard libraries into
a "CeeJay standard library", which is not idiomatic, not well
maintained, etc - or worse, we create a small number of simple
collections which do not have the required expressive power of a full
standard library.

** Function modeling
   :PROPERTIES:
   :NOTER_PAGE: (7 . 0.4883720930232558)
   :END:

It is very difficult to model functions (behaviour in
general). Authors point out challenges. We avoid this problem by not
modeling operations other than for the purposes of merging code
generation, which will be added later on.

** Predefined issues
   :PROPERTIES:
   :NOTER_PAGE: (9 . 0.41860465116279066)
   :END:

By relying on MOF, we start to pull in runtime dependencies to the
modeling environment, meaning all users of the generated code are now
exposed to the modeling implementation.

** References
   :PROPERTIES:
   :NOTER_PAGE: (10 . 0.3226744186046511)
   :END:

Papers to read:

Piefel, M.: A common metamodel for code generation. In: J. Aguilar (ed.), Pro-
ceedings of the 3rd International Conference on Cybernetics and Information Tech-
nologies, Systems and Applications. I I I S, Orlando, USA (2006)

* A Lightweight MDSD Process Applied in Small Projects
  :PROPERTIES:
  :NOTER_DOCUMENT: papers/A Lightweight MDSD Process Applied in Small Projects.pdf
  :END:

** Important success factors
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.26519337016574585)
   :END:

- "Its learning curve"
- "its adaptability to special requirements"
- "the maturity of the supporting tools"

** Range of tooling in MDE is vast
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.2900552486187845)
   :END:

Its never quite clear how one decides if a tool is part of MDE or not.

** pragmatic approach
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.2983425414364641)
   :END:

Similar to MDSD, the authors decided to take on a pragmatic approach
with the following key factors:

- partial usage
- create a tool rather than use an existing one due to cost factors;
  the include open source tools as well.
- iterative approach to building the tool.

** Target is small projects
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.3314917127071823)
   :END:

Similar to MASD, the target of this paper is the small and middle size
projects with limited resourcing.

** Requirments
   :PROPERTIES:
   :NOTER_PAGE: (2 . 0.2154696132596685)
   :END:

The requirements for this project are actually quite general:

- risk mitigation by allowing the use of traditional development if
  MDE is found to be problematic.
- no extra time allowed to develop MDE tools.
- cost is an important factor and training is limited.
- code should be human readable and modifiable.

** Activities
   :PROPERTIES:
   :NOTER_PAGE: (2 . 0.505524861878453)
   :END:

The approach is a traditional dual-track development model, with a
separation of the MDE team from the main team, and using integration
points to join the work. MASD is very different in that we intend to
back out the MDE parts of the work by empirical analysis of existing
code.

** MDE develppment process
   :PROPERTIES:
   :NOTER_PAGE: (3 . 0.7790055248618785)
   :END:

Crucially, the MDE development process is driven by the MDE team. They
work off of prototypes they develop and then deliver features to the
agile team which provides feedback. The problem with this approach is
that the features do not need to be grounded on the needs of the agile
team and can be speculative.

** Template development
   :PROPERTIES:
   :NOTER_PAGE: (4 . 0.09944751381215469)
   :END:

It is positive that templates are attempting to recreate code that was
manually crafted, as this is a very good sanity check.

** Bibliography
   :PROPERTIES:
   :NOTER_PAGE: (4 . 0.09944751381215469)
   :END:


- “Code Generation Information for the Pragmatic Engineer,” http://www.codegeneration.net/.
- V. Kulkarni and S. Reddy, “Introducing MDA in a Large IT Consultancy
  Organization,” in APSEC. IEEE Computer Society, 2006, pp. 419–426.
- G. Guta, B. Szasz, and W. Schreiner, “A Lightweight Model Driven Development Process based on XML Technology,”
RISC Report Series, University of Linz, Austria, Tech. Rep. 08-01, March 2008.

* Proceso de Desarrollo de Software Mediante Herramientas MDA

Link: http://www.iiisci.org/journal/CV$/risci/pdfs/C476AI.pdf

* Un estudio comparativo de dos herramientas MDA: OptimalJ y ArcStyler
  :PROPERTIES:
  :NOTER_DOCUMENT: papers/Un estudio comparativo de dos herramientas MDA: OptimalJ y ArcStyler.pdf
  :END:

Link: http://dis.um.es/~mjortin/articulos/tdsdm04.pdf

Words that are not clear:

- trazabilidad
- marcas: tagging?

** Important factors
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.46060254924681343)
   :END:

- PIM annotations
- whether the PSM is implicit or explicit.

** MDA principles
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.6170336037079954)
   :END:

- split the specification of the functionality of a software system
  from the implementation.

