dogen/papers.html

<div id="outline-container-org1de1da6" class="outline-3">
<h3 id="org1de1da6"><span class="section-number-3">2.12</span> UML Infrastructure</h3>
<div class="outline-text-3" id="text-2-12">
<p>
Whilst the authors claim their meta-model is designed for
code-generation, it seems its more concerned with UML compatibility
rather than a close fit to the the requirements of the generator. We
take the exact opposite approach: our model is designed specifically
to fit the code generation requirements.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">CeeJay type</th>
<th scope="col" class="org-left">Dogen Type</th>
<th scope="col" class="org-left">Comments</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Package</td>
<td class="org-left">Module</td>
<td class="org-left">Low-level mapping, forcing all of C++ elements to be declared in the same header.</td>
</tr>

<tr>
<td class="org-left">Class</td>
<td class="org-left">Object</td>
<td class="org-left">No multiple inheritance.</td>
</tr>

<tr>
<td class="org-left">Types</td>
<td class="org-left">N/A</td>
<td class="org-left">We use multiple meta-model types for this concept.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org289b59c" class="outline-3">
<h3 id="org289b59c"><span class="section-number-3">2.13</span> Handling of primitives</h3>
<div class="outline-text-3" id="text-2-13">
<p>
CeeJay expects the existence of a number of "core" types. This is not
enforced formally. Dogen sees these as plain model types, defined in
PDMs. Builtins are no different from any model type.
</p>
</div>
</div>

<div id="outline-container-orga837c6b" class="outline-3">
<h3 id="orga837c6b"><span class="section-number-3">2.14</span> Uniform interfaces to collections</h3>
<div class="outline-text-3" id="text-2-14">
<p>
CeeJay's approach of having uniform interfaces to collections is not
ideal because we either duplicate the existing standard libraries into
a "CeeJay standard library", which is not idiomatic, not well
maintained, etc - or worse, we create a small number of simple
collections which do not have the required expressive power of a full
standard library.
</p>
</div>
</div>

<div id="outline-container-orgffea59a" class="outline-3">
<h3 id="orgffea59a"><span class="section-number-3">2.15</span> Function modeling</h3>
<div class="outline-text-3" id="text-2-15">
<p>
It is very difficult to model functions (behaviour in
general). Authors point out challenges. We avoid this problem by not
modeling operations other than for the purposes of merging code
generation, which will be added later on.
</p>
</div>
</div>

<div id="outline-container-org294ade7" class="outline-3">
<h3 id="org294ade7"><span class="section-number-3">2.16</span> Predefined issues</h3>
<div class="outline-text-3" id="text-2-16">
<p>
By relying on MOF, we start to pull in runtime dependencies to the
modeling environment, meaning all users of the generated code are now
exposed to the modeling implementation.
</p>
</div>
</div>

<div id="outline-container-org6882381" class="outline-3">
<h3 id="org6882381"><span class="section-number-3">2.17</span> References</h3>
<div class="outline-text-3" id="text-2-17">
<p>
Papers to read:
</p>

<p>
Piefel, M.: A common metamodel for code generation. In: J. Aguilar (ed.), Pro-
ceedings of the 3rd International Conference on Cybernetics and Information Tech-
nologies, Systems and Applications. I I I S, Orlando, USA (2006)
</p>
</div>
</div>
</div>

<div id="outline-container-org35cdb64" class="outline-2">
<h2 id="org35cdb64"><span class="section-number-2">3</span> A Lightweight MDSD Process Applied in Small Projects</h2>
<div class="outline-text-2" id="text-3">
</div>

<div id="outline-container-org7d050c4" class="outline-3">
<h3 id="org7d050c4"><span class="section-number-3">3.1</span> Important success factors</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>"Its learning curve"</li>
<li>"its adaptability to special requirements"</li>
<li>"the maturity of the supporting tools"</li>
</ul>
</div>
</div>

<div id="outline-container-orgddca790" class="outline-3">
<h3 id="orgddca790"><span class="section-number-3">3.2</span> Range of tooling in MDE is vast</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Its never quite clear how one decides if a tool is part of MDE or not.
</p>
</div>
</div>

<div id="outline-container-org2a2ee1e" class="outline-3">
<h3 id="org2a2ee1e"><span class="section-number-3">3.3</span> pragmatic approach</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Similar to MDSD, the authors decided to take on a pragmatic approach
with the following key factors:
</p>

<ul class="org-ul">
<li>partial usage</li>
<li>create a tool rather than use an existing one due to cost factors;
the include open source tools as well.</li>
<li>iterative approach to building the tool.</li>
</ul>
</div>
</div>

<div id="outline-container-orge8219a6" class="outline-3">
<h3 id="orge8219a6"><span class="section-number-3">3.4</span> Target is small projects</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Similar to MASD, the target of this paper is the small and middle size
projects with limited resourcing.
</p>
</div>
</div>

<div id="outline-container-orgc0d27af" class="outline-3">
<h3 id="orgc0d27af"><span class="section-number-3">3.5</span> Requirments</h3>
<div class="outline-text-3" id="text-3-5">
<p>
The requirements for this project are actually quite general:
</p>

<ul class="org-ul">
<li>risk mitigation by allowing the use of traditional development if
MDE is found to be problematic.</li>
<li>no extra time allowed to develop MDE tools.</li>
<li>cost is an important factor and training is limited.</li>
<li>code should be human readable and modifiable.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc2a9dc0" class="outline-3">
<h3 id="orgc2a9dc0"><span class="section-number-3">3.6</span> Activities</h3>
<div class="outline-text-3" id="text-3-6">
<p>
The approach is a traditional dual-track development model, with a
separation of the MDE team from the main team, and using integration
points to join the work. MASD is very different in that we intend to
back out the MDE parts of the work by empirical analysis of existing
code.
</p>
</div>
</div>

<div id="outline-container-org945de10" class="outline-3">
<h3 id="org945de10"><span class="section-number-3">3.7</span> MDE develppment process</h3>
<div class="outline-text-3" id="text-3-7">
<p>
Crucially, the MDE development process is driven by the MDE team. They
work off of prototypes they develop and then deliver features to the
agile team which provides feedback. The problem with this approach is
that the features do not need to be grounded on the needs of the agile
team and can be speculative.
</p>
</div>
</div>

<div id="outline-container-org0511255" class="outline-3">
<h3 id="org0511255"><span class="section-number-3">3.8</span> Template development</h3>
<div class="outline-text-3" id="text-3-8">
<p>
It is positive that templates are attempting to recreate code that was
manually crafted, as this is a very good sanity check.
</p>
</div>
</div>

<div id="outline-container-orgbafe66c" class="outline-3">
<h3 id="orgbafe66c"><span class="section-number-3">3.9</span> Bibliography</h3>
<div class="outline-text-3" id="text-3-9">
<ul class="org-ul">
<li>“Code Generation Information for the Pragmatic Engineer,” <a href="http://www.codegeneration.net/">http://www.codegeneration.net/</a>.</li>
<li>V. Kulkarni and S. Reddy, “Introducing MDA in a Large IT Consultancy
Organization,” in APSEC. IEEE Computer Society, 2006, pp. 419–426.</li>
<li>G. Guta, B. Szasz, and W. Schreiner, “A Lightweight Model Driven Development Process based on XML Technology,”</li>
</ul>
<p>
RISC Report Series, University of Linz, Austria, Tech. Rep. 08-01, March 2008.
</p>
</div>
</div>
</div>

<div id="outline-container-orgedbd937" class="outline-2">
<h2 id="orgedbd937"><span class="section-number-2">4</span> Proceso de Desarrollo de Software Mediante Herramientas MDA</h2>
<div class="outline-text-2" id="text-4">
<p>
Link: <a href="http://www.iiisci.org/journal/CV$/risci/pdfs/C476AI.pdf">http://www.iiisci.org/journal/CV$/risci/pdfs/C476AI.pdf</a>
</p>
</div>
</div>

<div id="outline-container-org50f1446" class="outline-2">
<h2 id="org50f1446"><span class="section-number-2">5</span> Un estudio comparativo de dos herramientas MDA: OptimalJ y ArcStyler</h2>
<div class="outline-text-2" id="text-5">
<p>
Link: <a href="http://dis.um.es/~mjortin/articulos/tdsdm04.pdf">http://dis.um.es/~mjortin/articulos/tdsdm04.pdf</a>
</p>

<p>
Words that are not clear:
</p>

<ul class="org-ul">
<li>trazabilidad</li>
<li>marcas: tagging?</li>
</ul>
</div>

<div id="outline-container-org58a6923" class="outline-3">
<h3 id="org58a6923"><span class="section-number-3">5.1</span> Important factors</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>PIM annotations</li>
<li>whether the PSM is implicit or explicit.</li>
</ul>
</div>
</div>

<div id="outline-container-org32fce9c" class="outline-3">
<h3 id="org32fce9c"><span class="section-number-3">5.2</span> MDA principles</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>split the specification of the functionality of a software system
from the implementation.</li>
</ul>
</div>
</div>
