dogen/papers.org
** Model compiler
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.7734646581691773)
   :END:


MDA focuses on the creation of "model compilers" but we have not yet
found a formal definition of what one is. It is clearly related to the
transformations from CIM, PIM, PSM etc.

** Evaluation properties
   :PROPERTIES:
   :NOTER_PAGE: (2 . 0.6344148319814601)
   :END:

Properties that are evaluated for each tool. We should evaluate Dogen
against these as well. Measured as 0 to 4: nulo, mínimo, medio, bueno,
excelente

| Id  | Property                             | Comment                |
|-----+--------------------------------------+------------------------|
| P01 | PIM support                          |                        |
| P02 | PSM support                          |                        |
| P03 | Multiple implementations.            |                        |
| P04 | Model integration                    |                        |
| P05 | Interoperability                     |                        |
| P06 | Transformation definition            |                        |
| P07 | Model verification                   |                        |
| P08 | Use of patterns (GoF)                |                        |
| P10 | Support for incremental consistency  |                        |
| P11 | Support for model transforms         | PIM-PSM, PSM-PSM, etc. |
| P12 | Tracing                              |                        |
| P13 | Development lifecycle support        |                        |
| P14 | Use of standards                     |                        |
| P15 | Control and refinement of transforms |                        |
| P16 | Quality of generated code            |                        |
| P17 | Support tools                        |                        |

** OptimalJ: Three types of models
   :PROPERTIES:
   :NOTER_PAGE: (3 . 0.37369640787949016)
   :END:

- Domain model: high-level PIM (CIM?)
- Application model: PSM aspects such as J2EE implementation.
- Code model: generated from the application model.

** OptimalJ: Pattern types
   :PROPERTIES:
   :NOTER_PAGE: (3 . 0.46697566628041715)
   :END:


- Transformation patterns: patterns between models, transforming PIM
  to PSM, PSM to code, etc.
- Functional patterns: typical GoF patterns.

** OptimalJ: Protected regions
   :PROPERTIES:
   :NOTER_PAGE: (3 . 0.7560834298957126)
   :END:

Due to "open regions" and "protected regions", OJ is able to keep code
that was manually crafted between generations.

** ArcStyler: Cartridges
   :PROPERTIES:
   :NOTER_PAGE: (4 . 0.5214368482039398)
   :END:

According to the authors, this tool has a very advanced system for the
management of cartridges:

- they use UML profiles for the integration of cartridges with the
  modeling (for example, it defines a UML profile that exposes the EJB
  or Java 2 PSM functionality).
- there is a cartridge management system that handles them like
  plugins.
- its possible to define new cartridges from existing ones.

Info on the CARAT architecture can be found here:

- http://dis.um.es/~jmolina/documentos/CartuchosMDA.pdf

** Focus on design patterns
   :PROPERTIES:
   :NOTER_PAGE: (5 . 0.7300115874855156)
   :END:

Authors seem to imply that the extensive use of design patterns is
sufficient to determine the quality of the generated code. We disagree
with this opinion.

** Tradeoffs between integration and extensibility
   :PROPERTIES:
   :NOTER_PAGE: (7 . 0.38087520259319285)
   :END:

The two applications take very different approaches. OptimalJ focuses
its support mainly on J2EE and EJB. This allows it to provide
routripping and deep integration between PIM and PSM, and generate a
complete functional product. However, the company tightly controls the
product and users cannot extend it at will. On the other hand,
ArcStyle is openly extensible, but the downside is that cartridges
are responsible for making sure they interoperate. This means that
sometimes things don't work well with each other.

** Tracing
   :PROPERTIES:
   :NOTER_PAGE: (8 . 0.7293354943273905)
   :END:

It is very important to trace all elements such that one can tell what
model elements generated which files. Our tracing at present is mostly
concerned with obtaining model state before and after transforms and
is not designed for end users. However, a report detailing who
generated what would be extremely helpful.

** Bibliography

- MDA Guide Version 1.0.1. OMG. 2003.: More on model instance mapping
  and model type mapping in the
* An EMF-like UML generator for C++
  :PROPERTIES:
  :NOTER_DOCUMENT: papers/An EMF-like UML Generator for C++.pdf
  :END:

Link: https://www.scitepress.org/Papers/2016/57448/57448.pdf

** objectives
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.379746835443038)
   :END:

- targets legacy systems that have been written in c++ and therefore
  can't easily make use of EMF.

** unification
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.5523590333716917)
   :END:

One of OMGs goals is to unify every step of the development process,
from requirements gathering to deployment. We should make it clear
which parts of the development process we are aiming to automate.

** Java is the only first-class citizen of EMF
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.785385500575374)
   :END:

EMF is great for those in Java but it does not aim to provide support
outside of this environment.

