dogen/papers.html

<div id="outline-container-orgb7a182a" class="outline-3">
<h3 id="orgb7a182a"><span class="section-number-3">5.3</span> Model compiler</h3>
<div class="outline-text-3" id="text-5-3">
<p>
MDA focuses on the creation of "model compilers" but we have not yet
found a formal definition of what one is. It is clearly related to the
transformations from CIM, PIM, PSM etc.
</p>
</div>
</div>

<div id="outline-container-org8233a65" class="outline-3">
<h3 id="org8233a65"><span class="section-number-3">5.4</span> Evaluation properties</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Properties that are evaluated for each tool. We should evaluate Dogen
against these as well. Measured as 0 to 4: nulo, mínimo, medio, bueno,
excelente
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Id</th>
<th scope="col" class="org-left">Property</th>
<th scope="col" class="org-left">Comment</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">P01</td>
<td class="org-left">PIM support</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">P02</td>
<td class="org-left">PSM support</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">P03</td>
<td class="org-left">Multiple implementations.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">P04</td>
<td class="org-left">Model integration</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">P05</td>
<td class="org-left">Interoperability</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">P06</td>
<td class="org-left">Transformation definition</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">P07</td>
<td class="org-left">Model verification</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">P08</td>
<td class="org-left">Use of patterns (GoF)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">P10</td>
<td class="org-left">Support for incremental consistency</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">P11</td>
<td class="org-left">Support for model transforms</td>
<td class="org-left">PIM-PSM, PSM-PSM, etc.</td>
</tr>

<tr>
<td class="org-left">P12</td>
<td class="org-left">Tracing</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">P13</td>
<td class="org-left">Development lifecycle support</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">P14</td>
<td class="org-left">Use of standards</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">P15</td>
<td class="org-left">Control and refinement of transforms</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">P16</td>
<td class="org-left">Quality of generated code</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">P17</td>
<td class="org-left">Support tools</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgc786bc3" class="outline-3">
<h3 id="orgc786bc3"><span class="section-number-3">5.5</span> OptimalJ: Three types of models</h3>
<div class="outline-text-3" id="text-5-5">
<ul class="org-ul">
<li>Domain model: high-level PIM (CIM?)</li>
<li>Application model: PSM aspects such as J2EE implementation.</li>
<li>Code model: generated from the application model.</li>
</ul>
</div>
</div>

<div id="outline-container-org1f2290b" class="outline-3">
<h3 id="org1f2290b"><span class="section-number-3">5.6</span> OptimalJ: Pattern types</h3>
<div class="outline-text-3" id="text-5-6">
<ul class="org-ul">
<li>Transformation patterns: patterns between models, transforming PIM
to PSM, PSM to code, etc.</li>
<li>Functional patterns: typical GoF patterns.</li>
</ul>
</div>
</div>

<div id="outline-container-orgdcf086d" class="outline-3">
<h3 id="orgdcf086d"><span class="section-number-3">5.7</span> OptimalJ: Protected regions</h3>
<div class="outline-text-3" id="text-5-7">
<p>
Due to "open regions" and "protected regions", OJ is able to keep code
that was manually crafted between generations.
</p>
</div>
</div>

<div id="outline-container-orgd85c4cb" class="outline-3">
<h3 id="orgd85c4cb"><span class="section-number-3">5.8</span> ArcStyler: Cartridges</h3>
<div class="outline-text-3" id="text-5-8">
<p>
According to the authors, this tool has a very advanced system for the
management of cartridges:
</p>

<ul class="org-ul">
<li>they use UML profiles for the integration of cartridges with the
modeling (for example, it defines a UML profile that exposes the EJB
or Java 2 PSM functionality).</li>
<li>there is a cartridge management system that handles them like
plugins.</li>
<li>its possible to define new cartridges from existing ones.</li>
</ul>

<p>
Info on the CARAT architecture can be found here:
</p>

<ul class="org-ul">
<li><a href="http://dis.um.es/~jmolina/documentos/CartuchosMDA.pdf">http://dis.um.es/~jmolina/documentos/CartuchosMDA.pdf</a></li>
</ul>
</div>
</div>

<div id="outline-container-orged840af" class="outline-3">
<h3 id="orged840af"><span class="section-number-3">5.9</span> Focus on design patterns</h3>
<div class="outline-text-3" id="text-5-9">
<p>
Authors seem to imply that the extensive use of design patterns is
sufficient to determine the quality of the generated code. We disagree
with this opinion.
</p>
</div>
</div>

<div id="outline-container-orgb4ccef8" class="outline-3">
<h3 id="orgb4ccef8"><span class="section-number-3">5.10</span> Tradeoffs between integration and extensibility</h3>
<div class="outline-text-3" id="text-5-10">
<p>
The two applications take very different approaches. OptimalJ focuses
its support mainly on J2EE and EJB. This allows it to provide
routripping and deep integration between PIM and PSM, and generate a
complete functional product. However, the company tightly controls the
product and users cannot extend it at will. On the other hand,
ArcStyle is openly extensible, but the downside is that cartridges
are responsible for making sure they interoperate. This means that
sometimes things don't work well with each other.
</p>
</div>
</div>

<div id="outline-container-orgdc2bc60" class="outline-3">
<h3 id="orgdc2bc60"><span class="section-number-3">5.11</span> Tracing</h3>
<div class="outline-text-3" id="text-5-11">
<p>
It is very important to trace all elements such that one can tell what
model elements generated which files. Our tracing at present is mostly
concerned with obtaining model state before and after transforms and
is not designed for end users. However, a report detailing who
generated what would be extremely helpful.
</p>
</div>
</div>

<div id="outline-container-orgc12fdf0" class="outline-3">
<h3 id="orgc12fdf0"><span class="section-number-3">5.12</span> Bibliography</h3>
<div class="outline-text-3" id="text-5-12">
<ul class="org-ul">
<li>MDA Guide Version 1.0.1. OMG. 2003.: More on model instance mapping
and model type mapping in the</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org921feec" class="outline-2">
<h2 id="org921feec"><span class="section-number-2">6</span> An EMF-like UML generator for C++</h2>
<div class="outline-text-2" id="text-6">
<p>
Link: <a href="https://www.scitepress.org/Papers/2016/57448/57448.pdf">https://www.scitepress.org/Papers/2016/57448/57448.pdf</a>
</p>
</div>

<div id="outline-container-org162bcfd" class="outline-3">
<h3 id="org162bcfd"><span class="section-number-3">6.1</span> objectives</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>targets legacy systems that have been written in c++ and therefore
can't easily make use of EMF.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf86e87b" class="outline-3">
<h3 id="orgf86e87b"><span class="section-number-3">6.2</span> unification</h3>
<div class="outline-text-3" id="text-6-2">
<p>
One of OMGs goals is to unify every step of the development process,
from requirements gathering to deployment. We should make it clear
which parts of the development process we are aiming to automate.
</p>
</div>
</div>

<div id="outline-container-orgf9b5d18" class="outline-3">
<h3 id="orgf9b5d18"><span class="section-number-3">6.3</span> Java is the only first-class citizen of EMF</h3>
<div class="outline-text-3" id="text-6-3">
<p>
EMF is great for those in Java but it does not aim to provide support
outside of this environment.
</p>
</div>
</div>
