dogen/papers.org
** Workflow
   :PROPERTIES:
   :NOTER_PAGE: (2 . 0.4142692750287687)
   :END:

From a Dogen perspective, UML4CPP is just another PDM (platform
definition model) and we could target it. It would allow us to
generate "MDE compliant" code, useful for certain scenarios. For this
we probably also need a UML4CPP/ecore specific facet which is
responsible for bridging the Dogen meta-model elements into
ecore. Actually this is probably not a good idea because to bridge the
gap between the two different representations we would end up creating
a lot of brittle glue code. We should just have two completely
different kernels - the regular MASD kernel and an EMF kernel.

This approach is useful in two ways:

- to create an EMF injector. For this we could use the eCore code to
  parse EMF models and then adapt these into dogen as we do with any
  other injector type. The generated code will look like regular dogen
  code, and it will make use of the MASD kernel. This is just using
  eCore as a bridge into Dogen.
- the second approach is to have a EMF/eCore kernel which generates
  code which has the full functionality of eCore including
  run-time/dynamic aspects. For this we rely on UML4CPP as a PDM.

** Annotations
   :PROPERTIES:
   :NOTER_PAGE: (2 . 0.7686996547756041)
   :END:

eCore models are augmented via annotations. We need to understand how
these differ from our variability approach and make sure our names are
in line with the EMF annotation terminology.

** Two-generator approach
   :PROPERTIES:
   :NOTER_PAGE: (3 . 0.5005753739930956)
   :END:

Instead of having a single generator for both eCore and user models,
there is one eCore generator and another just for user models.

** Reflection
   :PROPERTIES:
   :NOTER_PAGE: (3 . 0.5868814729574223)
   :END:

Use of reflection at run time is seen as an essential property of the
approach. In contrast in MASD we aim to avoid using reflection as much
as possible.

** UML OpaqueBehaviour
   :PROPERTIES:
   :NOTER_PAGE: (3 . 0.6214039125431531)
   :END:

Investigate this term.

** Memory management
   :PROPERTIES:
   :NOTER_PAGE: (5 . 0.21576524741081704)
   :END:

Because the UML4CPP framework knows how the model is structured, it
can generate efficient memory management code. This means using raw
pointers is possible in a safe manner. In Dogen we have a similar
knowledge of the user code. We could also take advantage of this by
introducing some kind of "model level pointer" class which results in
generating appropriate memory management code.

** Benchmark
   :PROPERTIES:
   :NOTER_PAGE: (6 . 0.35385500575373996)
   :END:

We could implement the test model in Dogen and perform similar
benchmarks to compare the performance of an EMF based kernel versus a
MASD based kernel in Dogen.

** Bibliography
   :PROPERTIES:
   :NOTER_PAGE: (8 . 0.3020713463751439)
   :END:

Interesting papers:

- Jungebloud, T., Jager, S., Maschotta, R., and Zimmermann,
  A. (2013). MOF Compliant Fundamentals for Multi-Domain System
  Modeling and Simulation. In Systems Conference (SysCon), 2013 IEEE
  International, pages 191–194. IEEE.

* An Abstraction for Reusable MDD Components
  :PROPERTIES:
  :NOTER_DOCUMENT: papers/An Abstraction for Reusable MDD Components - Model-based Generation of Model-based Code Generators.pdf
  :END:

Link: https://dl.acm.org/doi/pdf/10.1145/1449913.1449940

Kulkarni, Vinay, and Sreedhar Reddy. "An abstraction for reusable MDD
components: model-based generation of model-based code generators."
Proceedings of the 7th international conference on Generative
programming and component engineering. 2008.


** Gist of the approach
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.4065998821449617)
   :END:

The paper describes a method for generation of code generators as a
hierarchical composition of reusable building blocks. A building
block is a localised specification; this is similar to our concept of
a physical space.

Authors propose a three step approach:

1. transform individual concern specific models into a unified model.
2. transform unified model into concern specific text artefacts
3. composition of the artefacts.

** Code patterns
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.760164997053624)
   :END:

Authors identify a separation of code into two types: business or
domain specific and architectural. For the architectural code, a
number of recurring patterns appear. These are effectively what we
have identified as SRAP.

** QVT default merging strategy
   :PROPERTIES:
   :NOTER_PAGE: (2 . 0.37124337065409546)
   :END:

In QVT the default "key based" merging strategy means that two
elements that have the same values for key properties are merged
together.

** Building block
   :PROPERTIES:
   :NOTER_PAGE: (2 . 0.4861520329994107)
   :END:

The unit of abstraction and composition they propose is the building
block. Presumably this is close to what we call a facet.

The composition proposed by this paper is akin to aspect oriented
weaving of blocks of text to form the final artefact. This is in
contrast to our approach which proposes such composition to be made
via facets. We should explain the pros and cons of both.

** Audit building block
   :PROPERTIES:
   :NOTER_PAGE: (3 . 0.5657041838538597)
   :END:

The paper proposes the creation of a building block responsible for
auditing. We could probably implement similar functionality in Dogen
using facets. Backlog this as a story.

#+begin_quote
This building block specifies how to maintain a persistent audit trail
of state changes of instances of a persistent class. Each persistent
class has a corresponding audit table having a column to store
time-stamp of the state change operation, a column to store the
pre-image and a column to store the post-image.
#+end_quote

** Issues with building blocks
   :PROPERTIES:
   :NOTER_PAGE: (4 . 0.601060695344726)
   :END:

These issues are similar to those we face in dogen.

1. The level at which we model building blocks is hard to gauge.
2. Its difficult to determine where one building block starts and
   another ends.
3. Separation of concerns of building blocks raises problems with
   tooling.
4. Tooling needs to support debugging BB.
5. Testing of building blocks should be possible in an independent
   manner.

** Bibliography
   :PROPERTIES:
   :NOTER_PAGE: (4 . 0.7690041249263405)
   :END:

- Harold Ossher, Peri L. Tarr: Hyper/J TM : Multi-Dimensional
  Separation of Concerns for Java TM . ICSE 2001: 821-822: HyperJ
  seems to have some similarities with stitchArchitecture-Centric
  Model-Driven Web Engineering.

