dogen/papers.html

<div id="outline-container-org9980595" class="outline-3">
<h3 id="org9980595"><span class="section-number-3">6.4</span> Workflow</h3>
<div class="outline-text-3" id="text-6-4">
<p>
From a Dogen perspective, UML4CPP is just another PDM (platform
definition model) and we could target it. It would allow us to
generate "MDE compliant" code, useful for certain scenarios. For this
we probably also need a UML4CPP/ecore specific facet which is
responsible for bridging the Dogen meta-model elements into
ecore. Actually this is probably not a good idea because to bridge the
gap between the two different representations we would end up creating
a lot of brittle glue code. We should just have two completely
different kernels - the regular MASD kernel and an EMF kernel.
</p>

<p>
This approach is useful in two ways:
</p>

<ul class="org-ul">
<li>to create an EMF injector. For this we could use the eCore code to
parse EMF models and then adapt these into dogen as we do with any
other injector type. The generated code will look like regular dogen
code, and it will make use of the MASD kernel. This is just using
eCore as a bridge into Dogen.</li>
<li>the second approach is to have a EMF/eCore kernel which generates
code which has the full functionality of eCore including
run-time/dynamic aspects. For this we rely on UML4CPP as a PDM.</li>
</ul>
</div>
</div>

<div id="outline-container-org97929e3" class="outline-3">
<h3 id="org97929e3"><span class="section-number-3">6.5</span> Annotations</h3>
<div class="outline-text-3" id="text-6-5">
<p>
eCore models are augmented via annotations. We need to understand how
these differ from our variability approach and make sure our names are
in line with the EMF annotation terminology.
</p>
</div>
</div>

<div id="outline-container-org216d4b9" class="outline-3">
<h3 id="org216d4b9"><span class="section-number-3">6.6</span> Two-generator approach</h3>
<div class="outline-text-3" id="text-6-6">
<p>
Instead of having a single generator for both eCore and user models,
there is one eCore generator and another just for user models.
</p>
</div>
</div>

<div id="outline-container-org6183535" class="outline-3">
<h3 id="org6183535"><span class="section-number-3">6.7</span> Reflection</h3>
<div class="outline-text-3" id="text-6-7">
<p>
Use of reflection at run time is seen as an essential property of the
approach. In contrast in MASD we aim to avoid using reflection as much
as possible.
</p>
</div>
</div>

<div id="outline-container-orga1baf76" class="outline-3">
<h3 id="orga1baf76"><span class="section-number-3">6.8</span> UML OpaqueBehaviour</h3>
<div class="outline-text-3" id="text-6-8">
<p>
Investigate this term.
</p>
</div>
</div>

<div id="outline-container-orgd053bcb" class="outline-3">
<h3 id="orgd053bcb"><span class="section-number-3">6.9</span> Memory management</h3>
<div class="outline-text-3" id="text-6-9">
<p>
Because the UML4CPP framework knows how the model is structured, it
can generate efficient memory management code. This means using raw
pointers is possible in a safe manner. In Dogen we have a similar
knowledge of the user code. We could also take advantage of this by
introducing some kind of "model level pointer" class which results in
generating appropriate memory management code.
</p>
</div>
</div>

<div id="outline-container-org9487012" class="outline-3">
<h3 id="org9487012"><span class="section-number-3">6.10</span> Benchmark</h3>
<div class="outline-text-3" id="text-6-10">
<p>
We could implement the test model in Dogen and perform similar
benchmarks to compare the performance of an EMF based kernel versus a
MASD based kernel in Dogen.
</p>
</div>
</div>

<div id="outline-container-org836aa80" class="outline-3">
<h3 id="org836aa80"><span class="section-number-3">6.11</span> Bibliography</h3>
<div class="outline-text-3" id="text-6-11">
<p>
Interesting papers:
</p>

<ul class="org-ul">
<li>Jungebloud, T., Jager, S., Maschotta, R., and Zimmermann,
A. (2013). MOF Compliant Fundamentals for Multi-Domain System
Modeling and Simulation. In Systems Conference (SysCon), 2013 IEEE
International, pages 191–194. IEEE.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org591c2b6" class="outline-2">
<h2 id="org591c2b6"><span class="section-number-2">7</span> An Abstraction for Reusable MDD Components</h2>
<div class="outline-text-2" id="text-7">
<p>
Link: <a href="https://dl.acm.org/doi/pdf/10.1145/1449913.1449940">https://dl.acm.org/doi/pdf/10.1145/1449913.1449940</a>
</p>

<p>
Kulkarni, Vinay, and Sreedhar Reddy. "An abstraction for reusable MDD
components: model-based generation of model-based code generators."
Proceedings of the 7th international conference on Generative
programming and component engineering. 2008.
</p>
</div>


<div id="outline-container-orgb2bb8c4" class="outline-3">
<h3 id="orgb2bb8c4"><span class="section-number-3">7.1</span> Gist of the approach</h3>
<div class="outline-text-3" id="text-7-1">
<p>
The paper describes a method for generation of code generators as a
hierarchical composition of reusable building blocks. A building
block is a localised specification; this is similar to our concept of
a physical space.
</p>

<p>
Authors propose a three step approach:
</p>

<ol class="org-ol">
<li>transform individual concern specific models into a unified model.</li>
<li>transform unified model into concern specific text artefacts</li>
<li>composition of the artefacts.</li>
</ol>
</div>
</div>

<div id="outline-container-orgaba521b" class="outline-3">
<h3 id="orgaba521b"><span class="section-number-3">7.2</span> Code patterns</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Authors identify a separation of code into two types: business or
domain specific and architectural. For the architectural code, a
number of recurring patterns appear. These are effectively what we
have identified as SRAP.
</p>
</div>
</div>

<div id="outline-container-orgcb70dea" class="outline-3">
<h3 id="orgcb70dea"><span class="section-number-3">7.3</span> QVT default merging strategy</h3>
<div class="outline-text-3" id="text-7-3">
<p>
In QVT the default "key based" merging strategy means that two
elements that have the same values for key properties are merged
together.
</p>
</div>
</div>

<div id="outline-container-org8f888d3" class="outline-3">
<h3 id="org8f888d3"><span class="section-number-3">7.4</span> Building block</h3>
<div class="outline-text-3" id="text-7-4">
<p>
The unit of abstraction and composition they propose is the building
block. Presumably this is close to what we call a facet.
</p>

<p>
The composition proposed by this paper is akin to aspect oriented
weaving of blocks of text to form the final artefact. This is in
contrast to our approach which proposes such composition to be made
via facets. We should explain the pros and cons of both.
</p>
</div>
</div>

<div id="outline-container-orgafbe6d0" class="outline-3">
<h3 id="orgafbe6d0"><span class="section-number-3">7.5</span> Audit building block</h3>
<div class="outline-text-3" id="text-7-5">
<p>
The paper proposes the creation of a building block responsible for
auditing. We could probably implement similar functionality in Dogen
using facets. Backlog this as a story.
</p>

<div class="epigraph"><blockquote>
<p>
This building block specifies how to maintain a persistent audit trail
of state changes of instances of a persistent class. Each persistent
class has a corresponding audit table having a column to store
time-stamp of the state change operation, a column to store the
pre-image and a column to store the post-image.
</p>

</blockquote></div>
</div>
</div>

<div id="outline-container-org3ab320a" class="outline-3">
<h3 id="org3ab320a"><span class="section-number-3">7.6</span> Issues with building blocks</h3>
<div class="outline-text-3" id="text-7-6">
<p>
These issues are similar to those we face in dogen.
</p>

<ol class="org-ol">
<li>The level at which we model building blocks is hard to gauge.</li>
<li>Its difficult to determine where one building block starts and
another ends.</li>
<li>Separation of concerns of building blocks raises problems with
tooling.</li>
<li>Tooling needs to support debugging BB.</li>
<li>Testing of building blocks should be possible in an independent
manner.</li>
</ol>
</div>
</div>

<div id="outline-container-org7fa00e6" class="outline-3">
<h3 id="org7fa00e6"><span class="section-number-3">7.7</span> Bibliography</h3>
<div class="outline-text-3" id="text-7-7">
<ul class="org-ul">
<li>Harold Ossher, Peri L. Tarr: Hyper/J TM : Multi-Dimensional
Separation of Concerns for Java TM . ICSE 2001: 821-822: HyperJ
seems to have some similarities with stitchArchitecture-Centric
Model-Driven Web Engineering.</li>
</ul>
</div>
</div>
</div>
