dogen/papers.org
* Architecture-Centric Model-Driven Web Engineering
  :PROPERTIES:
  :NOTER_DOCUMENT: papers/Architecture-Centric Model-Driven Web Engineering.pdf
  :END:

Link: http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.244.6866&rep=rep1&type=pdf

Escott, Eban, et al. "Architecture-centric model-driven web
engineering." 2011 18th Asia-Pacific Software Engineering
Conference. IEEE, 2011.

** AC-MDSD focuses on infrastructural code
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.3683241252302026)
   :END:

AC-MDSD captures structural patterns, mainly at the architectural
level. Due to this it does not focus on behaviour. Authors propose an
approach that allows architectural focus but with access to behaviour.

** Advantages of MDE for web apps
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.6721915285451198)
   :END:

- solves the boilerplate problem of web applications, that have a lot
  of commonality due to the tiered architecture.
- provides a model level understanding of architectural patterns,
  rather than having them scattered around code artefacts.
- provides re-usability because domain concepts are encapsulated in
  the model.

** Reference implementation driven approach
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.6906077348066298)
   :END:

The approach recommended by Stahl and Volter starts by creating a
reference implementation manually and then abstracting the general
(model-based) implementation from it. It has several advantages:

- high-quality code as a starting point, which is validated upfront
  using regular developer tools.
- the tooling produced is white-box, that is developers understand all
  of the inner workings of the tool unlike in vendor supplied tooling.

** White box and black box CASE tools
   :PROPERTIES:
   :NOTER_PAGE: (2 . 0.22099447513812157)
   :END:

- black box is where the tools hide the internals and provide a
  limited extensibility API. Users cannot modify or understand the
  tool at will.
- white box is where there is transparency of the inner workings of
  the tool Dogen is a white-box tool. It is important to provide a
  mapping between the model elements and the generated artefacts
  (e.g. tracing) at all levels of abstraction.

** Related work
   :PROPERTIES:
   :NOTER_PAGE: (2 . 0.5156537753222836)
   :END:

All of the approaches under analysis are dedicated solely to the
design of web applications, rather than attempting to generalise the
architectural patterns to enable applicability outside of this limited
scope. This is part of the issue Dogen tries to address.

** Graphical vs Textual
   :PROPERTIES:
   :NOTER_PAGE: (2 . 0.6629834254143647)
   :END:

Graphical notation is good for expressing intent visually whereas
textual notation is good for "structured summary presentation".

** DDD Entity pattern and manager (service)
   :PROPERTIES:
   :NOTER_PAGE: (3 . 0.5432780847145489)
   :END:

We need to review Evans (DDD) on entity pattern and manager. If what
this paper says is correct, this would be very amenable to code
generation because we separate behaviour (manager) from structure
(entity).

** Two-track development approach
   :PROPERTIES:
   :NOTER_PAGE: (3 . 0.7918968692449356)
   :END:

We should write a critique of this approach, and why we have chosen to
distil its principles but not partake in the exact approach in Dogen.

** AC-MDSD approach with regards to extensibility
   :PROPERTIES:
   :NOTER_PAGE: (7 . 0.423572744014733)
   :END:

The capturing of new patterns for Dogen is expected to be done
organically. This we share in common with AC-MDSD as described in
this paper.

** Bibliography
   :PROPERTIES:
   :NOTER_PAGE: (8 . 0.3775322283609577)
   :END:

- find multi-stage transformation process p188 in Sthal. The approach
  in dogen is to flatten the multi-stage pipeline into an
  heterogeneous meta-model. We should describe in detail the
  differences between the two approaches.
- we are using model-based testing in Dogen, so we need to find
  literature for this. E. Escott, P. Strooper, J. Steel, and P. King,
  “Integrating Model-Based Testing in Model-Driven Web Engineering,”
  in Proceedings of the Eighteenth Asia-Pacific Software Engineering
  Conference, 2011

* A UML Profile for Feature Diagrams: Initiating a Model Driven Engineering Approach for Software Product Lines
  :PROPERTIES:
  :NOTER_DOCUMENT: papers/A UML Profile for Feature Diagrams: Initiating a Model Driven Engineering Approach for Software Product Lines.pdf
  :END:

- Possompès, Thibaut, et al. "A UML Proﬁle for Feature Diagrams:
  Initiating a Model Driven Engineering Approach for Software Product
  Lines." Journée Lignes de Produits. 2010.
- Link: https://hal-lirmm.ccsd.cnrs.fr/lirmm-00542800/document

** Objective is full lifecycle
   :PROPERTIES:
   :NOTER_PAGE: (3 . 0.29374605180037905)
   :END:

The authors of the paper are targeting the analysis and requirements
gathering as well as the more traditional development modeling. We
have no such requirements. However they do target SPL as we do.

** Feature model elements
   :PROPERTIES:
   :NOTER_PAGE: (3 . 0.786481364497789)
   :END:

Key elements of feature model:

- product line contains features.
- product contains features and belongs to a product line.
- features associated with a product may have constraints such as
  require relations and mutual exclusions.
- features have feature properties. These describe feature parameters,
  or properties chosen by the user.
- variability kinds:
  - fixed: constant
  - variable: van be changed in a product, depending on other features.
  - family variable: can change from product to product.
  - user defined: given as input by the user.
- feature can have sub-features. This is a better term than feature
  bundles.

