dogen/papers.html

<div id="outline-container-orgcf2eec6" class="outline-2">
<h2 id="orgcf2eec6"><span class="section-number-2">8</span> Architecture-Centric Model-Driven Web Engineering</h2>
<div class="outline-text-2" id="text-8">
<p>
Link: <a href="http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.244.6866&amp;rep=rep1&amp;type=pdf">http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.244.6866&amp;rep=rep1&amp;type=pdf</a>
</p>

<p>
Escott, Eban, et al. "Architecture-centric model-driven web
engineering." 2011 18th Asia-Pacific Software Engineering
Conference. IEEE, 2011.
</p>
</div>

<div id="outline-container-org55824b1" class="outline-3">
<h3 id="org55824b1"><span class="section-number-3">8.1</span> AC-MDSD focuses on infrastructural code</h3>
<div class="outline-text-3" id="text-8-1">
<p>
AC-MDSD captures structural patterns, mainly at the architectural
level. Due to this it does not focus on behaviour. Authors propose an
approach that allows architectural focus but with access to behaviour.
</p>
</div>
</div>

<div id="outline-container-orga74cbe7" class="outline-3">
<h3 id="orga74cbe7"><span class="section-number-3">8.2</span> Advantages of MDE for web apps</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li>solves the boilerplate problem of web applications, that have a lot
of commonality due to the tiered architecture.</li>
<li>provides a model level understanding of architectural patterns,
rather than having them scattered around code artefacts.</li>
<li>provides re-usability because domain concepts are encapsulated in
the model.</li>
</ul>
</div>
</div>

<div id="outline-container-org0cf5855" class="outline-3">
<h3 id="org0cf5855"><span class="section-number-3">8.3</span> Reference implementation driven approach</h3>
<div class="outline-text-3" id="text-8-3">
<p>
The approach recommended by Stahl and Volter starts by creating a
reference implementation manually and then abstracting the general
(model-based) implementation from it. It has several advantages:
</p>

<ul class="org-ul">
<li>high-quality code as a starting point, which is validated upfront
using regular developer tools.</li>
<li>the tooling produced is white-box, that is developers understand all
of the inner workings of the tool unlike in vendor supplied tooling.</li>
</ul>
</div>
</div>

<div id="outline-container-org766b043" class="outline-3">
<h3 id="org766b043"><span class="section-number-3">8.4</span> White box and black box CASE tools</h3>
<div class="outline-text-3" id="text-8-4">
<ul class="org-ul">
<li>black box is where the tools hide the internals and provide a
limited extensibility API. Users cannot modify or understand the
tool at will.</li>
<li>white box is where there is transparency of the inner workings of
the tool Dogen is a white-box tool. It is important to provide a
mapping between the model elements and the generated artefacts
(e.g. tracing) at all levels of abstraction.</li>
</ul>
</div>
</div>

<div id="outline-container-orged25322" class="outline-3">
<h3 id="orged25322"><span class="section-number-3">8.5</span> Related work</h3>
<div class="outline-text-3" id="text-8-5">
<p>
All of the approaches under analysis are dedicated solely to the
design of web applications, rather than attempting to generalise the
architectural patterns to enable applicability outside of this limited
scope. This is part of the issue Dogen tries to address.
</p>
</div>
</div>

<div id="outline-container-orgf2dab26" class="outline-3">
<h3 id="orgf2dab26"><span class="section-number-3">8.6</span> Graphical vs Textual</h3>
<div class="outline-text-3" id="text-8-6">
<p>
Graphical notation is good for expressing intent visually whereas
textual notation is good for "structured summary presentation".
</p>
</div>
</div>

<div id="outline-container-orge022bf8" class="outline-3">
<h3 id="orge022bf8"><span class="section-number-3">8.7</span> DDD Entity pattern and manager (service)</h3>
<div class="outline-text-3" id="text-8-7">
<p>
We need to review Evans (DDD) on entity pattern and manager. If what
this paper says is correct, this would be very amenable to code
generation because we separate behaviour (manager) from structure
(entity).
</p>
</div>
</div>

<div id="outline-container-org1380f53" class="outline-3">
<h3 id="org1380f53"><span class="section-number-3">8.8</span> Two-track development approach</h3>
<div class="outline-text-3" id="text-8-8">
<p>
We should write a critique of this approach, and why we have chosen to
distil its principles but not partake in the exact approach in Dogen.
</p>
</div>
</div>

<div id="outline-container-org0a17872" class="outline-3">
<h3 id="org0a17872"><span class="section-number-3">8.9</span> AC-MDSD approach with regards to extensibility</h3>
<div class="outline-text-3" id="text-8-9">
<p>
The capturing of new patterns for Dogen is expected to be done
organically. This we share in common with AC-MDSD as described in
this paper.
</p>
</div>
</div>

<div id="outline-container-orge707e8e" class="outline-3">
<h3 id="orge707e8e"><span class="section-number-3">8.10</span> Bibliography</h3>
<div class="outline-text-3" id="text-8-10">
<ul class="org-ul">
<li>find multi-stage transformation process p188 in Sthal. The approach
in dogen is to flatten the multi-stage pipeline into an
heterogeneous meta-model. We should describe in detail the
differences between the two approaches.</li>
<li>we are using model-based testing in Dogen, so we need to find
literature for this. E. Escott, P. Strooper, J. Steel, and P. King,
“Integrating Model-Based Testing in Model-Driven Web Engineering,”
in Proceedings of the Eighteenth Asia-Pacific Software Engineering
Conference, 2011</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0eb6ac2" class="outline-2">
<h2 id="org0eb6ac2"><span class="section-number-2">9</span> A UML Profile for Feature Diagrams: Initiating a Model Driven Engineering Approach for Software Product Lines</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>Possompès, Thibaut, et al. "A UML Proﬁle for Feature Diagrams:
Initiating a Model Driven Engineering Approach for Software Product
Lines." Journée Lignes de Produits. 2010.</li>
<li>Link: <a href="https://hal-lirmm.ccsd.cnrs.fr/lirmm-00542800/document">https://hal-lirmm.ccsd.cnrs.fr/lirmm-00542800/document</a></li>
</ul>
</div>

<div id="outline-container-org04fb858" class="outline-3">
<h3 id="org04fb858"><span class="section-number-3">9.1</span> Objective is full lifecycle</h3>
<div class="outline-text-3" id="text-9-1">
<p>
The authors of the paper are targeting the analysis and requirements
gathering as well as the more traditional development modeling. We
have no such requirements. However they do target SPL as we do.
</p>
</div>
</div>

<div id="outline-container-orgf8673d8" class="outline-3">
<h3 id="orgf8673d8"><span class="section-number-3">9.2</span> Feature model elements</h3>
<div class="outline-text-3" id="text-9-2">
<p>
Key elements of feature model:
</p>

<ul class="org-ul">
<li>product line contains features.</li>
<li>product contains features and belongs to a product line.</li>
<li>features associated with a product may have constraints such as
require relations and mutual exclusions.</li>
<li>features have feature properties. These describe feature parameters,
or properties chosen by the user.</li>
<li>variability kinds:
<ul class="org-ul">
<li>fixed: constant</li>
<li>variable: van be changed in a product, depending on other features.</li>
<li>family variable: can change from product to product.</li>
<li>user defined: given as input by the user.</li>
</ul></li>
<li>feature can have sub-features. This is a better term than feature
bundles.</li>
</ul>
</div>
</div>
