dogen/papers.org
** Sub-features
   :PROPERTIES:
   :NOTER_PAGE: (4 . 0.6727732154137713)
   :END:

As with most papers on the subject of feature models, the grouping of
features is done mainly to allow for complex relationships between the
features in the group. Our main use case is quite trivial, we just
need to group features as if in a "package". We could of course make
use of a relationship such as the =AndGroup= but its not clear why one
would implement all of the complex logic around feature relationships
if we only require the simplest use case.

However, the authors put forward the notion of a "feature set", which
seems to be the ideal candidate for our "feature bundles". Feature
sets group features from an arbitrary point of view. This is what we
do when modeling features.

Feature sets enable complex relationships between features and feature
sets themselves. We could probably use some of this - for example, if
ORM stereotypes were features, we could determine which ORM features
are enabled or disabled on the back of it. However, this would require
a generalisation of a lot of the handling that has been hard coded
thus far and its not obvious what advantages would be gained by this
generalisation.

** UML Component as a feature
   :PROPERTIES:
   :NOTER_PAGE: (6 . 0.7770056854074542)
   :END:

Authors use components to model features because ports allow
expressing groups of associations of sub-features. Since we do not
have a need for complex groups, the simple grouping that attributes
enable us to do is sufficient.

** Model-relationship
   :PROPERTIES:
   :NOTER_PAGE: (7 . 0.2368919772583702)
   :END:

Investigate what a model relationship is. Presumably it is the
meta-type for aggregation, etc.

** Bibliography
   :PROPERTIES:
   :NOTER_PAGE: (12 . 0.6064434617814277)
   :END:

- [ASI 06] A SIKAINEN T., M ANNISTO T., S OININEN T., “A unified
  conceptual foundation for feature modelling”, SPLC ’06: Proceedings
  of the 10th International on Software Product Line Conference, IEEE
  Computer Society, 2006, p. 31–40.
- Check that this paper is the same one as we read in English: [CLA
  01] C LAUSS M., Untersuchung der Modellierung von Variabilität in
  UML, Technische Universität Dresden, Diplomarbeit, 2001.
- [POS ] P OSSOMPÈS T., D ONY C., H UCHARD M., R EY H., T IBERMACINE
  C., V ASQUES X., “Design of a UML profile for feature diagrams and
  its tooling implementation”, submitted. Gathering of requirements
  for the feature model.
* Generic Modeling using UML extensions for variability
  :PROPERTIES:
  :NOTER_DOCUMENT: papers/Generic Modeling using UML extensions for variability.pdf
  :END:

- Clauß, Matthias. "Generic modeling using UML extensions for
  variability." Workshop on Domain Specific Visual Languages at
  OOPSLA. Vol. 2001. 2001.
- Link: http://dsmforum.org/events/DSVL01/clauss.pdf

** Feature models target end users
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.8137583892617449)
   :END:

Authors agree with the general view that feature models are most
useful to model end-user related properties of the system. With Dogen
the line is blurred because our end-users are regular developers.

** Instantiation of models into products
   :PROPERTIES:
   :NOTER_PAGE: (2 . 0.16778523489932887)
   :END:

The authors take the view that the product line contains generic
models which are instantiated into concrete products and parameterised
via variability. Our view is similar, but we should probably make it
clear that our models are not very generic; only the high-level
structural patterns for a product line are meant to be captured and
its not really accurate to call dogen's models "generic".

** Variation points
   :PROPERTIES:
   :NOTER_PAGE: (2 . 0.2158273381294964)
   :END:

Variation points provide a useful way of handling variability.

** Generic models from Domain Engineering
   :PROPERTIES:
   :NOTER_PAGE: (2 . 0.5312672938572219)
   :END:

The objective of a generic model is to describe a product line
architecture; it contains a model of the variability and this model
must be bound - e.g. instantiated - in order to generate concrete
software artefacts.

** Hiding of less important information
   :PROPERTIES:
   :NOTER_PAGE: (3 . 0.19092418372993913)
   :END:

The author explains that tagged values should probably be hidden by
the tool given that they are not important for many use cases in
modeling. We will also have a similar approach when we move to the new
format for input.

We should discuss perceivability in the context of the new injector.

** Variation points
   :PROPERTIES:
   :NOTER_PAGE: (3 . 0.3154399557277255)
   :END:

The variation point allows having more than one "implementation" for a
given feature, and binding it to a user choice in the user model. In
this sense, we can say that our approach also entails variation
points, but these are encoded in the logical-physical space. We need
to compare and contrast the two approaches.

** Model evolution
   :PROPERTIES:
   :NOTER_PAGE: (3 . 0.7470946319867183)
   :END:

We should explicitly state this as a non-goal for the present version
of Dogen.

** Variation points and JSON
   :PROPERTIES:
   :NOTER_PAGE: (4 . 0.3901494189263973)
   :END:

One case where we need something extremely similar to variation points
is in allowing multiple implementations of a given "feature". For
example JSON serialisation. There are many libraries in C++ that
satisfy this requirement and each user may use one library for their
own reasons. However, it would be nice to be able to state that the
JSON feature is enabled without having to concern ourselves with the
specific implementation chosen. This seems to be very close to VPs.


** Binding times
   :PROPERTIES:
   :NOTER_PAGE: (5 . 0.5561704482567792)
   :END:

Authors provide a very fine grained approach to binding times. In
Dogen we took the simplest possible approach and all binding is done
at generation time. Presumably =build= time in the paper's categories.

** Variability at the model element level
   :PROPERTIES:
   :NOTER_PAGE: (5 . 0.7304925290536801)
   :END:

We should make it clear that we do not allow "too much" (to be defined
precisely what is meant by this later) variability in the logical
dimension. In other words, you cannot use parts of a object definition
based on variability parameterisation. There is the exception of
object templates.

** Bibliography
   :PROPERTIES:
   :NOTER_PAGE: (8 . 0.6889872717210846)
   :END:

- M. Clauß, Modeling variability with UML, GCSE 2001 - Young
  Researchers Workshop, September 2001
- M. Clauß, Untersuchung der Modellierung von Variabilität in UML,
  diploma thesis, August 2001. Try to locate an English translation.

