dogen/papers.html

<div id="outline-container-org281083e" class="outline-3">
<h3 id="org281083e"><span class="section-number-3">9.3</span> Sub-features</h3>
<div class="outline-text-3" id="text-9-3">
<p>
As with most papers on the subject of feature models, the grouping of
features is done mainly to allow for complex relationships between the
features in the group. Our main use case is quite trivial, we just
need to group features as if in a "package". We could of course make
use of a relationship such as the <code>AndGroup</code> but its not clear why one
would implement all of the complex logic around feature relationships
if we only require the simplest use case.
</p>

<p>
However, the authors put forward the notion of a "feature set", which
seems to be the ideal candidate for our "feature bundles". Feature
sets group features from an arbitrary point of view. This is what we
do when modeling features.
</p>

<p>
Feature sets enable complex relationships between features and feature
sets themselves. We could probably use some of this - for example, if
ORM stereotypes were features, we could determine which ORM features
are enabled or disabled on the back of it. However, this would require
a generalisation of a lot of the handling that has been hard coded
thus far and its not obvious what advantages would be gained by this
generalisation.
</p>
</div>
</div>

<div id="outline-container-orgb16de8e" class="outline-3">
<h3 id="orgb16de8e"><span class="section-number-3">9.4</span> UML Component as a feature</h3>
<div class="outline-text-3" id="text-9-4">
<p>
Authors use components to model features because ports allow
expressing groups of associations of sub-features. Since we do not
have a need for complex groups, the simple grouping that attributes
enable us to do is sufficient.
</p>
</div>
</div>

<div id="outline-container-org6cc8fc5" class="outline-3">
<h3 id="org6cc8fc5"><span class="section-number-3">9.5</span> Model-relationship</h3>
<div class="outline-text-3" id="text-9-5">
<p>
Investigate what a model relationship is. Presumably it is the
meta-type for aggregation, etc.
</p>
</div>
</div>

<div id="outline-container-org133e178" class="outline-3">
<h3 id="org133e178"><span class="section-number-3">9.6</span> Bibliography</h3>
<div class="outline-text-3" id="text-9-6">
<ul class="org-ul">
<li>[ASI 06] A SIKAINEN T., M ANNISTO T., S OININEN T., “A unified
conceptual foundation for feature modelling”, SPLC ’06: Proceedings
of the 10th International on Software Product Line Conference, IEEE
Computer Society, 2006, p. 31–40.</li>
<li>Check that this paper is the same one as we read in English: [CLA
01] C LAUSS M., Untersuchung der Modellierung von Variabilität in
UML, Technische Universität Dresden, Diplomarbeit, 2001.</li>
<li>[POS ] P OSSOMPÈS T., D ONY C., H UCHARD M., R EY H., T IBERMACINE
C., V ASQUES X., “Design of a UML profile for feature diagrams and
its tooling implementation”, submitted. Gathering of requirements
for the feature model.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge583ced" class="outline-2">
<h2 id="orge583ced"><span class="section-number-2">10</span> Generic Modeling using UML extensions for variability</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>Clauß, Matthias. "Generic modeling using UML extensions for
variability." Workshop on Domain Specific Visual Languages at
OOPSLA. Vol. 2001. 2001.</li>
<li>Link: <a href="http://dsmforum.org/events/DSVL01/clauss.pdf">http://dsmforum.org/events/DSVL01/clauss.pdf</a></li>
</ul>
</div>

<div id="outline-container-orgf511238" class="outline-3">
<h3 id="orgf511238"><span class="section-number-3">10.1</span> Feature models target end users</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Authors agree with the general view that feature models are most
useful to model end-user related properties of the system. With Dogen
the line is blurred because our end-users are regular developers.
</p>
</div>
</div>

<div id="outline-container-org43dcfe5" class="outline-3">
<h3 id="org43dcfe5"><span class="section-number-3">10.2</span> Instantiation of models into products</h3>
<div class="outline-text-3" id="text-10-2">
<p>
The authors take the view that the product line contains generic
models which are instantiated into concrete products and parameterised
via variability. Our view is similar, but we should probably make it
clear that our models are not very generic; only the high-level
structural patterns for a product line are meant to be captured and
its not really accurate to call dogen's models "generic".
</p>
</div>
</div>

<div id="outline-container-orgcaea277" class="outline-3">
<h3 id="orgcaea277"><span class="section-number-3">10.3</span> Variation points</h3>
<div class="outline-text-3" id="text-10-3">
<p>
Variation points provide a useful way of handling variability.
</p>
</div>
</div>

<div id="outline-container-orga99a027" class="outline-3">
<h3 id="orga99a027"><span class="section-number-3">10.4</span> Generic models from Domain Engineering</h3>
<div class="outline-text-3" id="text-10-4">
<p>
The objective of a generic model is to describe a product line
architecture; it contains a model of the variability and this model
must be bound - e.g. instantiated - in order to generate concrete
software artefacts.
</p>
</div>
</div>

<div id="outline-container-org6f9825e" class="outline-3">
<h3 id="org6f9825e"><span class="section-number-3">10.5</span> Hiding of less important information</h3>
<div class="outline-text-3" id="text-10-5">
<p>
The author explains that tagged values should probably be hidden by
the tool given that they are not important for many use cases in
modeling. We will also have a similar approach when we move to the new
format for input.
</p>

<p>
We should discuss perceivability in the context of the new injector.
</p>
</div>
</div>

<div id="outline-container-orgd0cb071" class="outline-3">
<h3 id="orgd0cb071"><span class="section-number-3">10.6</span> Variation points</h3>
<div class="outline-text-3" id="text-10-6">
<p>
The variation point allows having more than one "implementation" for a
given feature, and binding it to a user choice in the user model. In
this sense, we can say that our approach also entails variation
points, but these are encoded in the logical-physical space. We need
to compare and contrast the two approaches.
</p>
</div>
</div>

<div id="outline-container-org485a1b2" class="outline-3">
<h3 id="org485a1b2"><span class="section-number-3">10.7</span> Model evolution</h3>
<div class="outline-text-3" id="text-10-7">
<p>
We should explicitly state this as a non-goal for the present version
of Dogen.
</p>
</div>
</div>

<div id="outline-container-orgc9d7412" class="outline-3">
<h3 id="orgc9d7412"><span class="section-number-3">10.8</span> Variation points and JSON</h3>
<div class="outline-text-3" id="text-10-8">
<p>
One case where we need something extremely similar to variation points
is in allowing multiple implementations of a given "feature". For
example JSON serialisation. There are many libraries in C++ that
satisfy this requirement and each user may use one library for their
own reasons. However, it would be nice to be able to state that the
JSON feature is enabled without having to concern ourselves with the
specific implementation chosen. This seems to be very close to VPs.
</p>
</div>
</div>


<div id="outline-container-org25828b4" class="outline-3">
<h3 id="org25828b4"><span class="section-number-3">10.9</span> Binding times</h3>
<div class="outline-text-3" id="text-10-9">
<p>
Authors provide a very fine grained approach to binding times. In
Dogen we took the simplest possible approach and all binding is done
at generation time. Presumably <code>build</code> time in the paper's categories.
</p>
</div>
</div>

<div id="outline-container-org1bdedac" class="outline-3">
<h3 id="org1bdedac"><span class="section-number-3">10.10</span> Variability at the model element level</h3>
<div class="outline-text-3" id="text-10-10">
<p>
We should make it clear that we do not allow "too much" (to be defined
precisely what is meant by this later) variability in the logical
dimension. In other words, you cannot use parts of a object definition
based on variability parameterisation. There is the exception of
object templates.
</p>
</div>
</div>

<div id="outline-container-org48b6881" class="outline-3">
<h3 id="org48b6881"><span class="section-number-3">10.11</span> Bibliography</h3>
<div class="outline-text-3" id="text-10-11">
<ul class="org-ul">
<li>M. Clauß, Modeling variability with UML, GCSE 2001 - Young
Researchers Workshop, September 2001</li>
<li>M. Clauß, Untersuchung der Modellierung von Variabilität in UML,
diploma thesis, August 2001. Try to locate an English translation.</li>
</ul>
</div>
</div>
</div>
