dogen/papers.org
* Using Aspects to Model Product Line Variability
  :PROPERTIES:
  :NOTER_DOCUMENT: papers/Using Aspects to Model Product Line Variability.pdf
  :END:

- Groher, Iris, and Markus Voelter. "Using Aspects to Model Product Line
  Variability." SPLC (2). 2008.
- https://pdfs.semanticscholar.org/4c77/0315cd8151f6c162ac2f99ecc62225f4c94e.pdf?_ga=2.246561604.1739388568.1592151663-6190553.1592151663

** Product line engineering
   :PROPERTIES:
   :NOTER_PAGE: (2 . 0.636140135218193)
   :END:

- SPLE takes advantage of the commonalities between products in a
  family to improve reuse.
- products in a family differ from the features that have.
- features are increments in functionality.

** MDSD and AOSD
   :PROPERTIES:
   :NOTER_PAGE: (2 . 0.8297480024585125)
   :END:

The authors put forward a merge between these two approaches as a way
to manage the entire lifecycle of variability, as well as dealing with
the cross cutting nature of most features. They also argue that moving
to a model level abstraction permits a more compact and therefore more
manageable view of variability.

** Domain Engineering / Application Engineering
   :PROPERTIES:
   :NOTER_PAGE: (3 . 0.17516902274124155)
   :END:

Dogen uses the exact same approach as DE/AE, except the DE portion of
the work is related to the development of Dogen itself and the AE
portion of the work is the application of Dogen to user projects, done
via configuration.

** Model-level weaving
   :PROPERTIES:
   :NOTER_PAGE: (3 . 0.4425322679778734)
   :END:

The approach put forward results in the weaving of model elements,
something we are avoiding by design as it increases the complexity of
the modeling process quite a lot.

We need to compare and contrast the weaving that is performed by
object templates and configurations against the weaving of model
elements proposed by the paper. We should use weaving terminology for
these terms. We also should mention that after weaving you cannot tell
that weaving took place.

** Aspects for variability increases flexibility
   :PROPERTIES:
   :NOTER_PAGE: (3 . 0.6822372464658881)
   :END:

By using aspects, the model does not need to be prepared for
variability in advance. We take the contrasting view: we only support
very limited cases of variability, and these must be exposed
explicitly. Our approach is by design less flexible.

** Comparison between our approach and aspects
   :PROPERTIES:
   :NOTER_PAGE: (3 . 0.8205285802089736)
   :END:

The multidimensional approach put forward in Dogen overlaps to an
extent the AOM approach for variability in the paper. However we focus
on coarse grained features, we don't provide flexibility and
composition is only allowed in very narrow circumstances. We need to
provide a comparison of both approaches. However, we also have a clear
separation of the model elements and the variability modeling.

* A flexible code generator for MOF-based modeling languages
  :PROPERTIES:
  :NOTER_DOCUMENT: papers/A flexible code generator for MOF-based modeling languages.pdf
  :END:

- Bichler, Lutz. "A flexible code generator for MOF-based modeling
  languages." 2nd OOPSLA Workshop on Generative Techniques in the
  context of Model Driven Architecture. 2003.
- Link: https://s23m.com/oopsla2003/bichler.pdf

** MOmoC
   :PROPERTIES:
   :NOTER_PAGE: (1 . 0.5128923766816144)
   :END:

Authors put forward an approach that uses XMI as input, and parses it
into XML and then uses XSLT and stylesheets to convert the XML into
source code. From experience, we know this is not a scalable approach
as its too low-level.

** Model compiler
   :PROPERTIES:
   :NOTER_PAGE: (2 . 0.30269058295964124)
   :END:

Authors reference model compilers, and reference OMG but do not
provide a definition of a model compiler.

** MOmoC architecture
   :PROPERTIES:
   :NOTER_PAGE: (2 . 0.45403587443946186)
   :END:

- frontend is generated code that reads MOF models in XMI. Supports
  targetting the generation to other representations that are
  MOF-compliant.
- middle-end is supplement by user defined modules. At present it has
  a type mapping and naming resolution modules. Middle-end transforms
  types into XML
- backend is made up of XSLT that generate the implementation code.


Review of the paper: Groher, Iris, and Markus Voelter. "Using Aspects
to Model Product Line Variability." SPLC (2). 2008.
* A Comparison of Generative Approaches: XVCL and GenVoca
  :PROPERTIES:
  :NOTER_DOCUMENT: papers/A Comparison of Generative Approaches: XVCL and GenVoca.pdf
  :END:

- Paper: Blair, James, and Don Batory. "A Comparison of Generative
  Approaches: XVCL and GenVoca." Technical report, The University of
  Texas at Austin, Department of Computer Sciences (2004).
- Link: http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.457.1399&rep=rep1&type=pdf

** Compositional Design
   :PROPERTIES:
   :NOTER_PAGE: (4 . 0.19493177387914232)
   :END:

The idea is to start with a core and add progressively to it, with
each addition roughly corresponding to a feature. We propose a
compositional approach but based on multi-dimensionality.

** References

- Programming by difference: R.E. Johnson and B. Foote, “Designing
  Reusable Classes”, Journal of Object-Oriented Programming,
  June/July 1988.
* An evaluation of the Graphical Modeling Framework GMF based on the development of the CORAS tool
  :PROPERTIES:
  :NOTER_DOCUMENT: papers/An evaluation of the Graphical Modeling Framework GMF based on the development of the CORAS tool.pdf
  :END:

- Paper: Seehusen, Fredrik, and Ketil Stølen. "An evaluation of the
  graphical modeling framework (gmf) based on the development of the
  coras tool." International Conference on Theory and Practice of
  Model Transformations. Springer, Berlin, Heidelberg, 2011.
- Link: http://hjem.ifi.uio.no/ketils/kst/Articles/2011.ICMT.pdf
** Tagging in GMF
   :PROPERTIES:
   :NOTER_PAGE: (4 . 0.4036697247706422)
   :END:

Investigate how GMF code that is modified after code generation is
tagged so that the generator knows not to overwrite it.

Actually XPand allows for annotations in methods of the generated code
that indicate whether the methods should be overwritten or not.

** Packaging issues
   :PROPERTIES:
   :NOTER_PAGE: (10 . 0.6324786324786325)
   :END:


Authors argue that for a Tool B that reuses Tool A, it is not possible
to merely reference a package that contains both the source code of A
and the models of A; instead they ended up copying and pasting A into
B. It is not clear why the packaging of model plus source does not
work.
