dogen/papers.html

<div id="outline-container-orgf2a85ba" class="outline-2">
<h2 id="orgf2a85ba"><span class="section-number-2">11</span> Using Aspects to Model Product Line Variability</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>Groher, Iris, and Markus Voelter. "Using Aspects to Model Product Line
Variability." SPLC (2). 2008.</li>
<li><a href="https://pdfs.semanticscholar.org/4c77/0315cd8151f6c162ac2f99ecc62225f4c94e.pdf?_ga=2.246561604.1739388568.1592151663-6190553.1592151663">https://pdfs.semanticscholar.org/4c77/0315cd8151f6c162ac2f99ecc62225f4c94e.pdf?_ga=2.246561604.1739388568.1592151663-6190553.1592151663</a></li>
</ul>
</div>

<div id="outline-container-orgb707bda" class="outline-3">
<h3 id="orgb707bda"><span class="section-number-3">11.1</span> Product line engineering</h3>
<div class="outline-text-3" id="text-11-1">
<ul class="org-ul">
<li>SPLE takes advantage of the commonalities between products in a
family to improve reuse.</li>
<li>products in a family differ from the features that have.</li>
<li>features are increments in functionality.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb6277fe" class="outline-3">
<h3 id="orgb6277fe"><span class="section-number-3">11.2</span> MDSD and AOSD</h3>
<div class="outline-text-3" id="text-11-2">
<p>
The authors put forward a merge between these two approaches as a way
to manage the entire lifecycle of variability, as well as dealing with
the cross cutting nature of most features. They also argue that moving
to a model level abstraction permits a more compact and therefore more
manageable view of variability.
</p>
</div>
</div>

<div id="outline-container-orge0677c8" class="outline-3">
<h3 id="orge0677c8"><span class="section-number-3">11.3</span> Domain Engineering / Application Engineering</h3>
<div class="outline-text-3" id="text-11-3">
<p>
Dogen uses the exact same approach as DE/AE, except the DE portion of
the work is related to the development of Dogen itself and the AE
portion of the work is the application of Dogen to user projects, done
via configuration.
</p>
</div>
</div>

<div id="outline-container-orgded5de9" class="outline-3">
<h3 id="orgded5de9"><span class="section-number-3">11.4</span> Model-level weaving</h3>
<div class="outline-text-3" id="text-11-4">
<p>
The approach put forward results in the weaving of model elements,
something we are avoiding by design as it increases the complexity of
the modeling process quite a lot.
</p>

<p>
We need to compare and contrast the weaving that is performed by
object templates and configurations against the weaving of model
elements proposed by the paper. We should use weaving terminology for
these terms. We also should mention that after weaving you cannot tell
that weaving took place.
</p>
</div>
</div>

<div id="outline-container-org032de65" class="outline-3">
<h3 id="org032de65"><span class="section-number-3">11.5</span> Aspects for variability increases flexibility</h3>
<div class="outline-text-3" id="text-11-5">
<p>
By using aspects, the model does not need to be prepared for
variability in advance. We take the contrasting view: we only support
very limited cases of variability, and these must be exposed
explicitly. Our approach is by design less flexible.
</p>
</div>
</div>

<div id="outline-container-org7089e94" class="outline-3">
<h3 id="org7089e94"><span class="section-number-3">11.6</span> Comparison between our approach and aspects</h3>
<div class="outline-text-3" id="text-11-6">
<p>
The multidimensional approach put forward in Dogen overlaps to an
extent the AOM approach for variability in the paper. However we focus
on coarse grained features, we don't provide flexibility and
composition is only allowed in very narrow circumstances. We need to
provide a comparison of both approaches. However, we also have a clear
separation of the model elements and the variability modeling.
</p>
</div>
</div>
</div>

<div id="outline-container-org1d79f1b" class="outline-2">
<h2 id="org1d79f1b"><span class="section-number-2">12</span> A flexible code generator for MOF-based modeling languages</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li>Bichler, Lutz. "A flexible code generator for MOF-based modeling
languages." 2nd OOPSLA Workshop on Generative Techniques in the
context of Model Driven Architecture. 2003.</li>
<li>Link: <a href="https://s23m.com/oopsla2003/bichler.pdf">https://s23m.com/oopsla2003/bichler.pdf</a></li>
</ul>
</div>

<div id="outline-container-org60fc56d" class="outline-3">
<h3 id="org60fc56d"><span class="section-number-3">12.1</span> MOmoC</h3>
<div class="outline-text-3" id="text-12-1">
<p>
Authors put forward an approach that uses XMI as input, and parses it
into XML and then uses XSLT and stylesheets to convert the XML into
source code. From experience, we know this is not a scalable approach
as its too low-level.
</p>
</div>
</div>

<div id="outline-container-org183518c" class="outline-3">
<h3 id="org183518c"><span class="section-number-3">12.2</span> Model compiler</h3>
<div class="outline-text-3" id="text-12-2">
<p>
Authors reference model compilers, and reference OMG but do not
provide a definition of a model compiler.
</p>
</div>
</div>

<div id="outline-container-orgf184bfa" class="outline-3">
<h3 id="orgf184bfa"><span class="section-number-3">12.3</span> MOmoC architecture</h3>
<div class="outline-text-3" id="text-12-3">
<ul class="org-ul">
<li>frontend is generated code that reads MOF models in XMI. Supports
targetting the generation to other representations that are
MOF-compliant.</li>
<li>middle-end is supplement by user defined modules. At present it has
a type mapping and naming resolution modules. Middle-end transforms
types into XML</li>
<li>backend is made up of XSLT that generate the implementation code.</li>
</ul>


<p>
Review of the paper: Groher, Iris, and Markus Voelter. "Using Aspects
to Model Product Line Variability." SPLC (2). 2008.
</p>
</div>
</div>
</div>
<div id="outline-container-orge6369a8" class="outline-2">
<h2 id="orge6369a8"><span class="section-number-2">13</span> A Comparison of Generative Approaches: XVCL and GenVoca</h2>
<div class="outline-text-2" id="text-13">
<ul class="org-ul">
<li>Paper: Blair, James, and Don Batory. "A Comparison of Generative
Approaches: XVCL and GenVoca." Technical report, The University of
Texas at Austin, Department of Computer Sciences (2004).</li>
<li>Link: <a href="http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.457.1399&amp;rep=rep1&amp;type=pdf">http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.457.1399&amp;rep=rep1&amp;type=pdf</a></li>
</ul>
</div>

<div id="outline-container-orge6d1c78" class="outline-3">
<h3 id="orge6d1c78"><span class="section-number-3">13.1</span> Compositional Design</h3>
<div class="outline-text-3" id="text-13-1">
<p>
The idea is to start with a core and add progressively to it, with
each addition roughly corresponding to a feature. We propose a
compositional approach but based on multi-dimensionality.
</p>
</div>
</div>

<div id="outline-container-org0bf3762" class="outline-3">
<h3 id="org0bf3762"><span class="section-number-3">13.2</span> References</h3>
<div class="outline-text-3" id="text-13-2">
<ul class="org-ul">
<li>Programming by difference: R.E. Johnson and B. Foote, “Designing
Reusable Classes”, Journal of Object-Oriented Programming,
June/July 1988.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org249633f" class="outline-2">
<h2 id="org249633f"><span class="section-number-2">14</span> An evaluation of the Graphical Modeling Framework GMF based on the development of the CORAS tool</h2>
<div class="outline-text-2" id="text-14">
<ul class="org-ul">
<li>Paper: Seehusen, Fredrik, and Ketil Stølen. "An evaluation of the
graphical modeling framework (gmf) based on the development of the
coras tool." International Conference on Theory and Practice of
Model Transformations. Springer, Berlin, Heidelberg, 2011.</li>
<li>Link: <a href="http://hjem.ifi.uio.no/ketils/kst/Articles/2011.ICMT.pdf">http://hjem.ifi.uio.no/ketils/kst/Articles/2011.ICMT.pdf</a></li>
</ul>
</div>
<div id="outline-container-orgb791770" class="outline-3">
<h3 id="orgb791770"><span class="section-number-3">14.1</span> Tagging in GMF</h3>
<div class="outline-text-3" id="text-14-1">
<p>
Investigate how GMF code that is modified after code generation is
tagged so that the generator knows not to overwrite it.
</p>

<p>
Actually XPand allows for annotations in methods of the generated code
that indicate whether the methods should be overwritten or not.
</p>
</div>
</div>

<div id="outline-container-org14f462b" class="outline-3">
<h3 id="org14f462b"><span class="section-number-3">14.2</span> Packaging issues</h3>
<div class="outline-text-3" id="text-14-2">
<p>
Authors argue that for a Tool B that reuses Tool A, it is not possible
to merely reference a package that contains both the source code of A
and the models of A; instead they ended up copying and pasting A into
B. It is not clear why the packaging of model plus source does not
work.
</p>
</div>
</div>
