dogen/papers.html
<div id="outline-container-org80df858" class="outline-3">
<h3 id="org80df858"><span class="section-number-3">14.3</span> Avoid human interactions in generations</h3>
<div class="outline-text-3" id="text-14-3">
<p>
Authors argue that the generation process should be as mechanical as
possible, and should not have any human interacts, particularly using
UIs.
</p>
</div>
</div>
</div>

<div id="outline-container-orgad8d414" class="outline-2">
<h2 id="orgad8d414"><span class="section-number-2">15</span> Features as transformations: A generative approach to software development</h2>
<div class="outline-text-2" id="text-15">
<ul class="org-ul">
<li>Paper: Vranić, Valentino, and Roman Táborský. "Features as
transformations: A generative approach to software development."
Computer Science and Information Systems 13.3 (2016): 759-778.</li>
<li>Link: <a href="https://pdfs.semanticscholar.org/7f20/ee0ef94ba20161611c2ae184e6040f9d2fe1.pdf?_ga=2.47007141.386256099.1594564659-1149343892.1591869910">https://pdfs.semanticscholar.org/7f20/ee0ef94ba20161611c2ae184e6040f9d2fe1.pdf?_ga=2.47007141.386256099.1594564659-1149343892.1591869910</a></li>
</ul>
</div>

<div id="outline-container-org3242519" class="outline-3">
<h3 id="org3242519"><span class="section-number-3">15.1</span> Feature selection</h3>
<div class="outline-text-3" id="text-15-1">
<p>
Authors claim that feature selection is a much more complex process
than merely enabling a component. We are striving to make it so.
</p>
</div>
</div>

<div id="outline-container-orgb511593" class="outline-3">
<h3 id="orgb511593"><span class="section-number-3">15.2</span> Feature interaction</h3>
<div class="outline-text-3" id="text-15-2">
<p>
The fact that features interfere with each other and may require
adaptation in order to be applied to the system.
</p>
</div>
</div>

<div id="outline-container-orgbef6a51" class="outline-3">
<h3 id="orgbef6a51"><span class="section-number-3">15.3</span> Classification of transforms</h3>
<div class="outline-text-3" id="text-15-3">
<p>
Authors provide a simple classification of transforms which can be
used also to describe the SRAPs in Dogen.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf3daf4f" class="outline-2">
<h2 id="orgf3daf4f"><span class="section-number-2">16</span> Translating Alloy Specifications to UML Class Diagrams Annotated with OCL</h2>
<div class="outline-text-2" id="text-16">
<ul class="org-ul">
<li><a href="https://repositorium.sdum.uminho.pt/bitstream/1822/35641/1/848.pdf">https://repositorium.sdum.uminho.pt/bitstream/1822/35641/1/848.pdf</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd0d9885" class="outline-2">
<h2 id="orgd0d9885"><span class="section-number-2">17</span> Agile MDA</h2>
<div class="outline-text-2" id="text-17">
<ul class="org-ul">
<li>"An executable model, because it is executable, can be constructed,
run, tested and modified in short incremental, iterative cycles."
Executability is not a requirement for agility. Dogen models provide
exactly this type of development.</li>
<li>they fall into the voltaire pitfall: "To eliminate the verification
gap and enable immediate delivery of fragments of the system, what
we need is a highly abstract modeling language that focuses on a
single subject matter—the subject matter of interest to the
customer—and yet is specific and concrete enough to be executed, an
executable model."</li>

<li>Model Compilers: "A model compiler takes a set of executable UML
models and weaves them together according to a consistent set of
rules. This task involves executing the mapping functions between
the various source and target models to produce a single
all-encompassing metamodel (aka “the grungiest”) that includes all
the structure, behavior and logic—everything—in the system. The
final mapping from this metamodel can be done in several ways. One
approach to defining mapping functions is to use an archetype, which
are especially suited to manipulating text. Weaving the models
together at once addresses the problem of architectural mismatch, a
term coined by David Garlan to refer to components that do not fit
together without the addition of tubes and tubes of glue code, the
very problem MDA is intended to avoid! A model compiler imposes a
single architectural structure on the system as a whole."</li>
</ul>
</div>
</div>

<div id="outline-container-org43c929e" class="outline-2">
<h2 id="org43c929e"><span class="section-number-2">18</span> Model-driven Development of Complex Software: A Research Roadmap</h2>
<div class="outline-text-2" id="text-18">
<ul class="org-ul">
<li><a href="papers/Model-driven%20Development%20of%20Complex%20Software:%20A%20Research%20Roadmap.pdf">paper</a></li>
<li>MDA talks about CIM, PSM, PIM. In dogen we advocate a mix of PIM and
PSM. Users should try as much as possible to keep their models PIM,
but if need be, just drop to PSM. CIM and PIM are really a concept
that is meaningful at a level higher than dogen.</li>
<li>we do not think that automated platform migrations are a realistic
target so we do not support this use case.</li>
<li>we do not believe in the industrialisation of software
development. The activity is too complex to be automated. However,
this does not mean that a small amount of automation is not
possible. Voltaire: le mieux est l'ennemi du bien.</li>
<li>"Reusable forms of development experience (e.g., patterns,
templates, guidelines, transformations) are associated with each
viewpoint, and thus accessible in the context of that viewpoint." We
are trying to do this with facets.</li>
<li>separation of design concerns: facets can be understood as different
design concerns. maybe there is a need to talk about macro-concerns
(architectural) and micro-concerns (class-level). Facets can span
both but we are only worried about micro for now. However, when it
comes to describe the generation model we will have to address this
issue.</li>
<li>it seems facets are an AOM (aspect oriented modeling)
approach. However, instead of allowing multiple viewpoints and
composition, we treat aspects/facets as variation points and the
composition is pushed down to the (feature) configuration
level. This solves a lot of the difficulties around composition of
primary and aspect models.</li>
<li>facets focus only on trivial behaviours, making composition
trivial. Also, in general, they are implemented external to the
class so that merging is not an issue and its much easier to isolate
conflicts. However, this must be done manually by the designer of
the class, and stipulated as a rule (e.g. facet a depends on b and
conflicts with c).</li>
</ul>
</div>
</div>

<div id="outline-container-org53e5e9e" class="outline-2">
<h2 id="org53e5e9e"><span class="section-number-2">19</span> A meta-model for language-independent refactoring</h2>
<div class="outline-text-2" id="text-19">
<ul class="org-ul">
<li><a href="papers/A%20Meta-model%20for%20Language-Independent%20Refactoring.pdf">paper</a></li>
<li>Why they created their own metamodel: "Another reason is that models
such as UML [18] are directed towards object-oriented analysis and
design rather than source code representation." This also applies to
dogen.</li>
<li>the pre and post conditions may have some use for dogen
validation. For example adding new classes, methods etc.</li>
<li>we could also reuse the analysis on the costs:
<ul class="org-ul">
<li>"Increased complexity of algorithms. To deal with multiple
languages the underlying model needs to be general enough to cover
the supported languages."</li>
<li>"Mapping back to the actual code. The actual code changes are,
naturally, language specific. However, in some cases the concepts
that are generalized at the language-independent level (e.g. Java
constructors are methods, Java interfaces are classes) need to be
mapped back to their language-specific kind, because at the code
level they need to be dealt with differently than their ‘normal’
counterparts."</li>
<li>"Language-independent defaults. To keep some refactorings as
language independent as possible, some defaults are used."</li>
</ul></li>
<li>similarly, section "Not all language differences can be abstracted
from." also has a lot of good points.</li>
</ul>
</div>
</div>
