dogen/papers.org
* Metrics on Feature Models to Optimise Configuration Adaptation at Runtime

- paper not in our library
- a use case for this paper is facet enablement, In an ideal world, we
  should be able to look at the included files in a project and
  backout the used facets. We can then determine what is not being
  used (diff generated files from included files). Then we can propose
  a list of facets to disable (or types to remove) to the user. This
  also solves the TB problem: delete types that are not in use. It has
  to be robust enough to understand graphs of types (e.g. no includes
  of base, but derived etc). Interestingly, we only need the includes
  (no deep parsing of the AST). However, we do need to know of all
  consumers of a model. Perhaps we could make use of public/internal
  separation: types marked as public are excluded. The second problem
  is that we cannot easily patch the model with the resulting facet
  enablement.
- however the approach given on this paper does not apply directly to
  our needs because we never need to do a search in a space. Our use
  cases are:
  - 1. user selects a feature configuration, we validate it. If
    invalid, throw and tell the user why. User has to manually fix it.
  - 2. user selects a feature configuration and we automatically
    enable/disable any features based on dependencies. If we can't
    enable a feature (not supported), throw and tell the user (or
    possibly disable the graph using the feature).
  - 3. user points to a code base and we determine what files have
    been included. From this we back out used features. We diff this
    against the list of generated features and automatically propose a
    feature minimal configuration.

  None of these cases requires searching through a feature space.

* A UML profile for feature diagrams

- [[file:papers/A%20UML%20profile%20for%20feature%20diagrams:%20Initiating%20a%20model%20driven%20engineering%20approach%20for%20software%20product%20lines.pdf][paper]]
- this meta-model is very useful for dogen. We could implement it as a
  model and then extend it with the requirements needed for dogen (is
  it a global feature or element feature, more fine-grained types,
  etc). The model should expose annotations as a flat representation
  of the rich feature model. It should convert from annotations into
  the model, performing validation. It should also validate
  dependencies (build a graph of features).
- in addition, we need to create a UML profile to expose the model,
  and then create a dogen model with the profile. The generated code
  should read annotations and return instantiated features with the
  correct types.
- we should try to make this model generic so that it can be used by
  applications. However, given that there is no notion of annotations,
  we probably need a different way of expressing it. Perhaps we could
  use boost property tree. In fact that is the right approach: boost
  property tree becomes the underlying representation; we make
  =Annotatable= contain a property tree; the generated code generates
  the C++ data types that represent the configuration, and it has a
  load/save (not quite those names) to serialise and deserialise
  itself from a property tree. When defining a feature we need to
  supply its "path", e.g. the path to the class. The path to the
  attribute is inferred by the name. Now this code is completely
  agnostic to code generation - it is merely a way to do
  configuration. We just need to add the notion of scopes so that we
  can distinguish between element and model level options. Actually
  the notions of global and local are not dependent on code
  generation, but what global and local mean are.
- for extra bonus points, it would be nice to be able to map features
  to program options as well; instead of property tree, we would
  generate the code to setup the program options as well as the class
  to represent the options. The user could specify the implementation
  mapping as meta-data (a feature).
- note that we can just map a feature set to a class because then its
  not possible to define the complex relationships between features
  (and/or etc). These are required particularly if we want a program
  options mapping. The approach in the paper is not ideal but at least
  it solves this problem.

* AndroMDA

- [[file:papers/AndroMDA%20-%20German.pdf][paper]] (german)
- MDA: "The transformation of the models into platform-specific source
  code requires tools and frameworks."
- AndroMDA generates ready to use applications; we focus on extracting
  simple structural functions.
- AndroMDA is designed to fit into MDA, we are targeting unorthodox
  practitioners.

