dogen/papers.org
* Construction and Evolution of Code Generators

- [[file:papers/Construction%20and%20Evolution%20of%20Code%20Generators:%20A%20Model-Driven%20and%20Service-Oriented%20Approach%20-%202013.pdf][thesis]]
- "In essence, even though there are code generator workbenches that
  help the programming expert to design dedicated code generators,
  more high-level activities like process support, variability
  management, or product lining are not foreseen."
- jorges code generator has support for constraint solving and model
  checking.
- jorges points to AndroMDA, seems very similar to what we are trying
  to do. We need to find more about it and explain why we are
  different.
- one of the problems of this approach is that we now have to deal
  with SIBs and jABC: a completely different paradigm from how
  developers are used to working. What we really need is an
  abstraction that is very close to the code first.
- the library of common SIBs is similar in spirit to a library of
  common facets.
- our target is only the developer. There are no features for domain
  experts, business analysts, etc.
- we do not want XMDD given it aims for full generation. We need
  something more like Agile MDD with barely good enough models and
  modeling.
- we need to look at their constraints checker and see if any of the
  constraints or the approach can be lifted for dogen.
- in order to do model checking one needs to be familiar with modal mu
  calculus. Most regular developers won't so very few will add checks.
- facets are part of our strategy of variant management. The variation
  points are metadata parameters that allow configuration of the
  facet.
- we have a similar notion of execution context, but ours is strongly
  typed. This may not be flexible enough for its requirements.
- the context could also contain the error stack with all errors found
  so far (validation etc).
- unlike genesys, in dogen we have a fixed interface for facets and
  they are always consumed via the metadata. We don't expect users to
  create new code generators, we only allow variability via
  metadata. Two use cases: 1) code generator developer, either does a
  new kernel (very infrequent) or adds a new facet to the facet
  library 2) code generator user: configures the variability.
- benchmarking is probably helpful: figure out where in dogen time is
  going. We already have probing for this but it does not give details
  on individual facets.
- meta-information about facets would be helpful. It is useful for
  example for listing the available facets (with a description), their
  configuration parameters, their dependencies. Similarly with kernels
  and backends.
- facets and aspects are implementations of features.
- we should have exactly a three-phase approach in dogen: 1)
  initialisation 2) transformation 3) generation. We already have this
  except we mapped the generation phase as a transform. However, in
  the thesis we can describe the three phases like Jorges (p119). This
  also means that all of the "static" registration we have at present
  can now be placed into the initialisation phase. If we had a
  top-level "phase manager" we could simply call the phases from
  main. We must also keep in mind the "service" approach, where we may
  process more than one model (e.g. transformation + generation are
  applied repeatedly).
- however, the three phase approach has to do with orchestration (it
  will manifest itself as classes or methods in orchestrator). The
  code structure should follow a frontend, middleend, backend
  pipeline. This is more suitable than external, modeling and
  generator.
- we need to also have an ecore example/case study where we should
  make the same points as ch7: dogen does something that no other EMF
  tool does (facets).

* Bridging the Gap Between Features and Models

- [[file:papers/Bridging%20the%20Gap%20Between%20Features%20and%20Models.pdf][paper]]
- the variant model is in effect a feature configuration. A
  realisation of the feature model. The variant model is used in the
  solution space to determine what features to include.
- there are two types of features: "We differentiate two types of
  features: features that have realisations connected to specific
  points in the core and features that add duplicated artefacts
  scattered across various points in an aspectual manner."
- "In our work we differentiate two feature types: collaborative
  features and aspectual features." This separation is very useful for
  dogen features: we need to classify dogen features, and explain how
  they map implementation-wise. However, we need to also state that we
  do not offer a generic mechanism to the user - instead, the user
  should use whatever technologies are available for modeling.
- in order to meet our requirements, dogen does not rely on any
  existing MDE technology; it is designed to integrate with existing
  tooling but does not require it. Thus we do not make use of ecore
  etc.

* Generating Aspect Code from UML Models

- [[file:papers/Generating%20Aspect%20Code%20from%20UML%20Models.pdf][paper]]
- "Code generation improves developer productivity, ensures
  syntactical correctness and reduces errors when mapping model to
  code."

