dogen/papers.org
* State of the art of QVT: a model transformation language standard

- [[file:papers/LNCS%20-%20Applications%20of%20Graph%20Transformations%20with%20Industrial%20Relevance%20-%202007.pdf][paper]]
- explains the motivation behind PSM/PIM: "This classification is
  motivated by the constant change in implementation technologies and
  the recurring need to port software from one technology to another."
- the ideas behind QVT are interesting, but in some ways the DSL makes
  it harder to understand them. If instead we simply had a library
  with MOF and then say two metamodels (MOF instances): relational
  model and UML model. Then we could define a function that
  transformed one metamodel element to another, say =class= to
  =table=. So in terms of programming, one could imagine a reflection
  based API with "objects" where each object could have a metatype
  (recursively, until reflexivity takes over):

#+begin_example
class o;
o.name("my_class");
...
if (o.metatype() == class) {
    table t;
    t.name(o.name());
}
#+end_example

- this is most useful if the code generation model is able to generate
  arbitrary code - e.g. the structural patterns which we are encoding
  into the code generation metamodel are now expressed as
  transforms. This allows for arbitrary structural patterns, but it
  does mean: a) the code generation metamodel must be very generic b)
  the transforms are much more complex.
- in the case of a financial model, we would create a DSL with all of
  the financial products. Then, we'd instantiate the DSL with the
  actual products supported by the company. So a vanilla option for
  example is implemented as a deliverable product, with cashflows
  etc. Then we transform this model into several other metamodels
  (code generation metamodel, UI metamodel, etc). For example the UI
  metamodel could have concepts such as form, button etc. To represent
  a vanilla, we would transform the financial product metamodel into
  the UI metamodel:

#+begin_example
vanilla v;
form f;
f.title(v.name());
...
#+end_example

  Each of the individual elements of the products will have mappings
  to the UI metamodel. Then, the UI metamodel is code generated by a
  kernel specialised on the UI metamodel. Metamodels and generators
  come in pairs. These pairs are kernels: OO, relational, XML/XSD, UI,
  etc. Features can be implemented either as facets/aspects on an
  existing kernel (e.g. ODB for relational) or, if they have their own
  metamodel, as a kernel (e.g. relational kernel). Kernels can depend
  on other kernels (e.g. the relational kernel depends on the OO
  kernel because it creates c++ code that reads/writes c++ objects to
  a relational database). Users create their metamodels and models in
  ecore, which we then transform to the kernel models.

* Generative Programming Using Frame Technology

- [[file:papers/Generative%20Programming%20Using%20Frame%20Technology.pdf][paper]]
- in general it seems there isn't much of frame technology we can
  reuse. However there are a few concepts: frame layers, framework and
  frame libraries. However, where frames are very configurable and
  reusable, facets are designed to have as few variation points as
  possible and to be reused as is. You either need boost serialisation
  or you do not - there isn't a lot of scope for variation points.
- dogen is a single-phased generator: "A single-phased generator (see
  Figure 3.12:2) works sequentially. It takes its input (see Figure
  3.12:1) which consists of specific parameters and commands mixed
  with code of the target language and processes it. In case of a
  frame processor these are the frames and functions. During the
  evaluation of the input source, the generator can use data from a
  repository (see Figure 3.12:3) to enhance or check the input. A
  repository in this context means any kind of data storage that
  contains configuration data (e.g. a database or a
  XML-file). Finally, it produces an output (see Figure 3.12:5) with
  the production process running mostly in the same order as the input
  is structured. These outputs are often volatile. Every piece of
  generated source code is instantaneously released and can not be
  further processed, or evaluated for the processing of other source
  code [DST02b, p. 15]."
- the concept of frames and frame instances is useful: maybe we can
  use it when defining the facet space and the implementation
  space. But really artefacts are archetype instances already.
- frame processors use command line arguments. We are against this
  approach. We should probably explain why variability should be
  contained within the model and not leaked through to the command
  line.

