dogen/papers.html

<div id="outline-container-org5c80c1a" class="outline-2">
<h2 id="org5c80c1a"><span class="section-number-2">28</span> Ecore.Fmp: A Tool For Editing And Instantiating Class Models As Feature Models</h2>
<div class="outline-text-2" id="text-28">
<ul class="org-ul">
<li><a href="papers/Ecore.Fmp:%20A%20Tool%20For%20Editing%20And%20Instantiating%20Class%20Models%20As%20Feature%20Models.pdf">paper</a></li>
<li>typical usage of EMF "Ecore is a part of the Eclipse Modeling
Framework (EMF), a framework that provides a practical foundation
for building modeling tools. When using EMF, users typically first
create a metamodel for their domain in the form of an Ecore class
model. Next, the users may use a code generator that generates an
implementation of the metamodel or they can utilize the metamodel
using reflection. The code generator Figure 2 shows a feature model
that represents the class can also create a specialized graphical
tree editor for ing and editing object models for the given
metamodel."</li>
<li>ecore annotations are similar to ours: "Ecore, similarly to
Essential MOF, also supports a tagging mechanism which allows
annotating each class model element with a set of key-value
pairs. In Ecore, instances of the class EModelElement can contain
many instances of the class EAnnotation , which, in turn, has a
String to String map that represents key to value pairs. The
complete metamodel of Ecore can be found at [1]."</li>
<li>perhaps what we are trying to do is to model the feature model as a
fixed set of classes - in effect, the feature model metamodel; then
add the logic around it (graph, dependencies and so forth) as
manually written code; then allow dogen developers to define a
concrete feature model (an instance) by making use of a UML profile,
which then generates code that instantiates the feature model
instance; then when we are processing a user UML model, the user
supplies a feature configuration which is an instance of the dogen
feature model instance. Its all done at run time. We do not need to
do this at run time for all of the features that make up the core of
Dogen - we could have properly typed c++ classes. Then there should
be a type layer which is part of the code generated feature model
instance which can be instantiated from the feature model
metamodel. We need to use the ecore.fmp mappings to convert say
feature groups into classes and features into properties. The
generated code automatically knows how to try to bootstrap one of
these classes from features. In effect we have three layers:
<ul class="org-ul">
<li>annotation: KVP layer</li>
<li>feature model: dynamic layer with feature model metamodel.</li>
<li>feature model instance: set of c++ classes with a typed
representation of the actual feature model. Inject typing into the
feature model.</li>
<li>feature configuration: user UML diagram making use of the
available features.</li>
</ul></li>
<li>interestingly, feature models do not have any binding in terms of
scope to metamodel elements. Thus the FM metamodel will not have
this concept. However, for dogen we need this. We could introduce
the notion of local and global - in practice this is sufficient for
all of the existing use cases. Or we may just have to hack the
feature metamodel specifically for dogen.</li>
<li>which perhaps raises the point of: are features not just modeling
elements, present in the dogen codegeneration metamodel? This would
make life easier and add more research weight. If we did fold the
feature metamodel into the metamodel this would have the following
consequences:
<ul class="org-ul">
<li>we would need a transformation that creates value objects from
features and converts them into the c++ typesystem.</li>
<li>we need a mapping that reads these typed objects in and out of
feature metamodel elements.</li>
<li>we need some manually crafted code that converts an annotation
into instances of these feature metamodel elements.</li>
<li>we need manually crafted code that handles global/local,
overrides, etc.</li>
<li>we need a template that injects instances of the feature metamodel
elements.</li>
<li>we need some way of registering the c++ types so that we can
generate them from the feature metamodel. Or perhaps this is done
on the fly as users ask for them.</li>
<li>we must not bind feature metamodel directly to annotations; it
should work against any KVP representation with the concepts of
local and global.</li>
<li>one slight snag though: in order to use the feature metamodel in
their own code, users now need to link against the dogen
metamodel. So this is a dogen specific thing. If however, we were
to construct the needle model and make it independent of dogen, we
could move it there. It would make more sense to have a feature
model as an external library like <a href="https://github.com/EmilianoSanchez/Feature-Model-Optimization">Feature Model Optimization</a>. Or
maybe there are two aspects to it: first there is the external
library that does all the computations and optimisations to FM and
provides a non-typed API to features. Then there is the dogen
support, which does several things: 1) maps features to codegen
metamodel; 2) instantiates the external library based on the
metamodel 3) creates strongly typed representations of
features; 4) maps external library to strongly typed.</li>
</ul></li>
<li>future work: how to plug user defined feature models back into dogen
such that users can make structural features (classes, attributes)
dependent on feature configuration. We do not have a use case for
this. at present there are two separate worlds: 1) general feature
model 2) dogen's usage of general feature model for internal
purposes 3) dogen's generation of helper code on top of general
feature model so that users can make use of it. This would be a
fourth use case.</li>
<li>the paper seems to allude to a solution on the cyclical references
in feature configuration, though its not obvious how it works: "In
the case of feature configuration, the upward branch traversal is
stopped when an instance is reached. If none of the elements in the
cyclic containment are a root feature, then the user is required to
annotate the desired EClass that should be the root feature using
the annotation root as discussed earlier."</li>
</ul>
</div>
</div>
