dogen/papers.html

<div id="outline-container-orge3e4326" class="outline-2">
<h2 id="orge3e4326"><span class="section-number-2">29</span> Towards Separation of Concerns in Model Transformation Workflows</h2>
<div class="outline-text-2" id="text-29">
<ul class="org-ul">
<li><a href="papers/Towards%20Separation%20of%20Concerns%20in%20Model%20Transformation%20Workflows.pdf">paper</a></li>
<li>definition: "modeling workflow (workflow): It emphasizes that there
may be other tasks to specify than only model transformations, for
example model loading, storing, checking, or code generation."</li>
<li>shortcomings of workflow technologies: 1) integration effort: hard
to add further transformation technologies 2) flexibility: hard to
specify additional processes 3) inadequate variability management
support.</li>
<li>this paper provides a basic analytical framework with which to
evaluate modeling workflows. We could apply it to Dogen and explain
why we have taken the present approach. Its probably beyond the
scope of the thesis, but suitable for the Dogen manual.</li>
<li>we can also benefit from making workflows more explicit with named
components. This could be the start of the natural evolution towards
a DSL. Types of workflow elements: model checkers, creators,
transformers, finishers, chains.</li>
<li>they defend the integration of multiple technologies, whereas we are
against it. It raises the complexity bar even further. We believe
there should be interfaces defined at a higher level such as using
ecore as an input model to the generator. We have no bearing in what
is done prior to the generation of the ecore model. The code
generation workflow is completely decoupled from any preceding
workflow that was used to generate the ecore model.</li>
<li>using a DSML for workflow generation is similar to using workflow
engines for other purposes: you end up encoding all of the FSM logic
in fragments of XML that are extremely hard to debug and manage. You
loose all of the affordances that regular GPL code gives you. It may
appear to be more expressive but the end result is that you spend
more time trying to get things to work.</li>
<li>this hits the nail on the head with our notions of fractal
engineering: "The strict separation of concerns, which we foster
throughout this paper, has a particular reason: we especially are
interested in the terms and conditions for the decomposition and
composition of whole product lines. Product generation of a compound
product originated from several product lines is a potentially
highly complex task. Several product generation processes, one of
each product line, may have to interact to create the final
product. Thus, a clear interface for interaction is necessary, and,
for model-driven product lines, model transformation workflows
result to be a promising integration point for that purpose."</li>
<li>however, our approach is to decouple product interfaces. A product
line may make use of another product's interface but we should never
need to assemble one product from several products. The unit of
development is the product, and product lines make products. A
product may rely on other systems (e.g. association) but it is not
"composed" of other products from a code generation perspective. It
is logically, but not physically. This is in order to avoid the
problems highlighted above.</li>
</ul>
</div>
</div>

<div id="outline-container-orgea94e0e" class="outline-2">
<h2 id="orgea94e0e"><span class="section-number-2">30</span> Classification of Model Transformation Approaches</h2>
<div class="outline-text-2" id="text-30">
<ul class="org-ul">
<li><a href="papers/Classification%20of%20Model%20Transformation%20Approaches.pdf">paper</a></li>
<li>it seems what we are doing is in the spirit of frame processing. We
need to read up on frame processing.</li>
<li>we could explain our transforms from external models to
code-generation model to augmented model with this "Why are
model-to- model transformations needed? When bridging large
abstraction gaps between PIMs and PSMs, it is easier to generate
intermediate models rather than go straight to the target PSM."</li>
<li>XDE seems to be interesting. Parameterisation is what we already do
for facets. They seem to tackle patterns.</li>
</ul>
</div>
</div>
