dogen/papers.org
* Feature-Based Survey of Model Transformation Approaches

- [[file:papers/Feature-Based%20Survey%20of%20Model%20Transformation%20Approaches.pdf][paper]]
- we need to review dogen transformations with regards to the features
  in this paper and try to see where we can make the interfaces
  reflect this terminology. For example, we seem to loop through the
  model and then find elements of interest to mutate. They seem to
  suggest we should first query/filter the model using a rule and then
  apply the mutation to the result of the query/filter. This would
  perhaps improve the code. The query result could be a typed
  container (pointer container?) with the elements that match. That
  means we can then start to converge towards a rule engine. However,
  we'd have to go through all the transforms and see if they would all
  benefit from this split.
- we use imperative programming for the rules.
- We make use of both: "Transformations with source and target domains
  conforming to a single metamodel are referred to as endogenous or
  rephrasings; whereas transformations with different source and
  target metamodels are referred to as exogenous or
  translations."
- Dogen supports transformation tracing, which we called probing.
- we seem to use control parameters quite a lot. They are used to
  convey feature configuration. "Parameterization. The simplest kind
  of parameterization are control parameters, which allow passing
  values as control flags (see Figure 14). Control parameters are
  useful to implement policies. For example, a transformation from
  class models to relational schemas could have a control parameter
  specifying which of the alternative patterns of object-relational
  mapping should be used in a given execution."
- Dogen uses the mechanisms of the language to organise transforms
  into chains.
- not a big fan of the usage of the word rule.
- our source-target relationship is chosen based on the needs of the
  transform. Sometimes we use in-place, in other cases (such as
  merging and translation) we use distinct source and targets.
- we do not support incrementality by design. Makes the generator more
  complex.
- all of our transforms are unidirectional, with the exception of
  model merging. Here we need some kind of way of reading the
  protected region into the artefact.
- we extend the [[http://jamda.sourceforge.net/][Jamda]] approach:

#+begin_quote
Jamda is an open-source framework for building application generators
which create Java code from a model of the business domain. Instead of
a generator which produces one fixed architecture, Jamda provides a
structure and building blocks so that you can build an application
generator which does exactly what your project needs. It includes a
sample generator for J2EE applications which can either be tailored to
the needs of your J2EE project, or used as the basis of a generator
for a completely different architecture.

From a UML model of the application domain, a generator created with
Jamda could create the code for all the standard functions of
locating, displaying and updating the business objects in the
application. The developer would then concentrate on the
application-specific business logic, which is merged into the
generated application. In a typical application, the developer would
only need to write around 20% of the total system code.

Is it a Model Driven Architecture tool?

An application generator built using Jamda would perform the role of a
model compiler in the Object Management Group's Model Driven
Architecture specification. It takes a UML domain model as input, adds
new classes to the model to support the implementation, and then
generates executable code.
#+end_quote

- we follow exactly the same approach: "The openArchitectureWare
  Generator Framework propagates the idea of separating more complex
  source access logic, which might need to navigate and gather
  information from different places of the source model, from
  templates by moving the logic into user-defined operations of the
  source-model elements." We need to explain that our metamodel is
  designed with this in mind.
- we have chosen the direct manipulation approach for the M2M
  transforms:

#+begin_quote
Direct-Manipulation Approaches

These approaches offer an internal model representation plus some API
to manipulate it, such as JMI.  They are usually implemented as an
object-oriented framework, which may also provide some minimal
infrastructure to organize the transformations (e.g., abstract class
for transformations). However, users have to usually implement
transformation rules, scheduling, tracing, and other facilities,
mostly from scratch in a programming language such as Java.
#+end_quote

  However, we do provide the framework on which to implement the
  transforms so that users do not have to worry about any of the
  concerns listed above.
- actually perhaps we take an hybrid approach. 1) we use direct
  manipulation because the framework is defined in a GPL. 2) we also
  use the structure-driven approach because we have similar phasing:
  "Approaches in this category have two distinct phases: the first
  phase is concerned with creating the hierarchical structure of the
  target model, whereas the second phase sets the attributes and
  references in the target. The overall framework determines the
  scheduling and application strategy; users are only concerned with
  providing the transformation rules." 3) clearly we have an
  operational approach because we have more dedicated support for
  model transformation (e.g. the dogen API).
- our transforms are implemented as imperative rules: "A fully
  imperative rule (so-called procedure) has a name, a set of formal
  parameters, and an imperative block, but no patterns."
-

