dogen/papers.html

<div id="outline-container-orgde1a2f8" class="outline-2">
<h2 id="orgde1a2f8"><span class="section-number-2">32</span> Software Diversity: State of the Art and Perspectives</h2>
<div class="outline-text-2" id="text-32">
<ul class="org-ul">
<li><a href="papers/Software%20Diversity%20%E2%80%93%20State%20of%20the%20Art%20and%20Perspectives.pdf">paper</a></li>
<li>they focus on "anticipating variability". We believe it should not
be anticipated, but discovered and incorporated organically and
systematically into the system.</li>
<li>variability can either be planned or emergent. We believe in
emergent variability. Another pillar of fractal systems
development. Emergent does not imply implicit. You can make it
explicit.</li>
<li>the feature model of a general purpose, OO code generator lives in
problem space - i.e. the problem space of code generation. This is a
special case where the problem space and the solution space are the
same. In fact "general purpose" is not quite right: it is special
purpose in the sense its design to model only OO and features that
can be expressed as functional dependencies of structural models.</li>
<li>our approach seems to be this one: "annotative approaches or
superimposed variants representing negative variability—all variants
of the product line are included within the same model."</li>
<li>the key advantage of our approach is that instead of having to do
structural surgery to the model, we are simply switching facets on
or off. This is a much easier thing to achieve. "Variant annotations
define which parts of the model have to be removed to derive a
concrete product model."</li>
<li>its very important to split out the feature definition and the
feature use. For definition we can rely on overloading UML
(stereotypes, etc). However, we still need to figure out how to
solve the contraints problem (dependencies, etc). For use we can
simply rely on stereotypes and tagged values.</li>
<li>orthogonal variability model seems interesting. We could go for
capturing variability separate from the model, but variability
application does require the model. Here we are referring to code
generator variants.</li>
<li>we use a compositional approach to associate data with model
elements such as include files and metatype information.</li>
<li>they use the term "model fragment" on compositional
approaches. Perhaps proxy models are just model fragments.</li>
<li>so we use positive variability at the model level and negative
variability at the template level because facets are combined to
generate the complete model representation.</li>
<li>we seem to rely on both collaborative features (facets) as well as
aspectual features (helpers).</li>
<li>"Diversity interfaces and switches in Koala can be understood as
concrete language constructs targeted at the implementation level to
express variation points and associated variants."</li>
<li>"When modeling variability, features or decisions are just (problem
space) abstractions of the variability realized in real development
artifacts." However, this is not the case with code generators
because the problem space of the code generator is intertwined with
the solution space.</li>
<li>"Other variability modeling approaches define a separate artifact
model, which exposes artifact abstractions to the decision or
feature model". This seems to be what we are doing. We took
advantage of the fact that code generators are a bit special and
mapped the artefacts to the feature model (or vice-versa).</li>
<li>we need to read the lose programming paper to see if that is what we
are doing.</li>
<li>feature interaction analysis is interesting but it is beyond the e
scope of all the work we have outlined at present. Similarly with
model checking and deductive logic.</li>
<li>to some extend we are taking on the one thing approach (see
paper). Its just that our end customers are not the SPL end
customers but the code generator SPL end customers -
i.e. developers. This means we put the developer at the centre of
our concerns. In this light the one thing paper may be useful, most
likely for the Dogen manual. Our objective is not to make the
modeling of problem domain entities easier but to model solution
space / implementation level patterns that appear in the artefacts.</li>
<li>by controlling the entire pipeline we control the evolution and thus
can confine it somewhat and make sure all the parts fit. The
disadvantage is the limited developer pool to work on all the
aspects of the tool chain.</li>
<li>predictive vs opportunistic software reuse when using SPL</li>
</ul>
</div>
</div>

<div id="outline-container-orgeb9a9c5" class="outline-2">
<h2 id="orgeb9a9c5"><span class="section-number-2">33</span> Variability in Software Architecture: Current Practices and Challenges</h2>
<div class="outline-text-2" id="text-33">
<ul class="org-ul">
<li><a href="papers/Variability%20in%20Software%20Architecture:%20Current%20Practice%20and%20Challenges.pdf">paper</a></li>
<li>it seems that the scope of variability is too vast. We need
different strategies for different kinds of variability.</li>
<li>interestingly, the "welcome mat" approach is also related to
variability. That is, the support of multiple protocols (JSON, XML,
HTTP, etc) for comms, the packaging as a library (static, shared),
or as a component (COM, CORBA), or as a service, unbinding the UI
technology from the implementation so that multiple UIs can be
supported (Wt, GTK, Qt, TUI), etc are all variability concerns from
an architectural perspective. The product team is responsible for
enabling variability across most of these dimensions. What is
lacking is a taxonomy/classification of the different kinds of
variability.</li>
<li>the paper provides a method for identifying variation points at the
architectural level. It also provides an approach for analysing the
VPs.</li>
<li>functional core approach: define not just what varies in a product
but also what is constant. The functional core is the essence of the
product. We take this approach on Dogen. We need to define what we
consider to be part of the functional core and what is allowed to
vary. The functional core is what makes that product unique. Each
functional core must be well-understood, and cannot be too large. It
must be straightforward to decide if new functionality is in keeping
with the functional core or not. Its understanding will evolve over
time, incrementally.</li>
<li>its not necessarily the case that everything needs to be
automated/tooled around. Its useful to model variability separately
even if its not possible to make the most of those models; it means
everyone is conscious about introducing and documenting variability
into the system. It should not be taken lightly.</li>
<li>variability is a manifestation of indecision on a decision topic. If
there is a decision such as "do not include" then we do not need a
variation point. If there is a decision such "as always include"
then its likely to be added to the functional core (although
Savolainen disagrees and states that not all mandatory features are
part of the functional core; not clear how so).</li>
</ul>
</div>
</div>

<div id="outline-container-org3d685dc" class="outline-2">
<h2 id="org3d685dc"><span class="section-number-2">34</span> Systems Variability Modeling: A Textual Model Mixing Class and Feature Concepts</h2>
<div class="outline-text-2" id="text-34">
<ul class="org-ul">
<li><a href="papers/Systems%20Variability%20Modeling:%20A%20Textual%20Model%20Mixing%20Class%20and%20Feature%20Concepts.pdf">paper</a></li>
<li>definition of the feature model and the application (feature
configuration) are different things. We should split them with two
approaches: text based approach for the former, and model mixing for
the latter.</li>
<li>splitting features according to types is a good idea, but not sure
we agree on their classification.</li>
</ul>
</div>
</div>
