dogen/papers.org
* A Common Metamodel for Code Generation
  :PROPERTIES:
  :ID:       7cf59c6b-3230-4805-8398-d9397711ac45
  :END:

- [[file:papers/A%20Common%20Metamodel%20for%20Code%20Generation.pdf][paper]]
- very similar to previous paper.
- We take a similar approach: "As has been outlined in [4], we use a
  package with common meta- modelling building blocks for all our
  metamodelling activities.  This makes it easier to speak about
  common concepts under the same name, much as Design Patterns in
  software engineering help programmers to talk about common
  programming concepts."
- they chose names similar to UML infrastructure; we have chosen names
  that are different to ensure there is no confusion between language
  concepts and modeling concepts, as well as not having problems with
  reserved words.
- they re-implemented UML infrastructure (parts of MOF that are in
  UML?), and question whether to reuse it or re-implement it. We take
  the view that whilst conceptually it is very useful, at the
  implementation level it does not add any value.
- there are differences between modeled languages (say namespaces /
  packages); it is the role of the metamodel to normalise them and the
  code generator to express them as idiomatically as possible.
- we use the same approach of named elements, but we partitioned the
  naming space.
- they do not constrain elements to exist in packages; we more or less
  do, although there are hacks to place things in the global
  namespace. We need to clean this up.
- due to normalisation (least common denominator) we also do not allow
  multiple inheritance on data structures.
- as the model is OO, there are limitations when modeling to non-OO
  languages such as C. It is still possible though, and useful even
  without support for operations.
- we do not distinguish between collections at the metamodel
  level. However, they link to aspects in the generator. At present we
  do not support built-in collections (e.g. int[]). This is only
  because the parsing engine does not parse them.
- we do not model entry points such as main, etc at present. We could
  in the future, but its better to simply bypass the dogen and create
  files manually.
- Java has package visibility, C# has internal visibility. Whilst we
  do not have a way to model these, we could create the notion of
  internal which in C++ means hide the header files and do not export
  symbols. In C# use external. In java, ignore it.

* A Code Generation Metamodel for ULF-Ware
  :PROPERTIES:
  :ID:       f80dfa29-68e9-4971-a183-3bbb8d81cee8
  :END:

- [[file:papers/A%20Code%20Generation%20Metamodel%20for%20ULF-Ware.pdf][paper]]
- extremely interesting paper, which tackles exactly the same problem
  as dogen: "While code can be generated from any model, we propose to
  use an intermediate model that is tailored to code generation
  instead. In order to be able to easily support different target
  languages, this model should be general enough; in order to support
  the whole process, the model has to contain behavioural as well as
  structural aspects."
- however, they seem to also focus on behaviour. Worth seeing what
  they have to say, but we are explicitly moving away from it.
- "Generally, adding another library with the same interface does not
  require new transformations." Similar to Dogen, except we also cater
  for impedance mismatches between metamodel and the library. For this
  we use an aspect oriented approach, where feature configuration is
  used to bind aspects to elements.
- they have decided to use MOF as their metamodel.  We have used UML
  to define our metamodel. We need a good explanation for our approach
  given its a lot less orthodox. We did not find the MOF types useful
  to our model. Need to justify this.
- crucial quote, totally applicable to us: "High-level models are
  quite different from programs in conventional programming
  languages. They abstract from most of the detail that a programming
  language exhibits. Once you want to generate real code, all this
  detail has to be filled in. This makes code generation from those
  models a difficult task. Moreover, many decisions in this process
  are similar for different target languages, but it is hard to make
  use of these commonalities." Our key objective was to design a model
  that modeled these aspects.
- very important point on "close to the language but not too close":
  "The reverse approach is to use models that are very low-level and
  close to a specific language. There have been a number of papers
  such as [6] implement- ing this. The metamodel obtained this way is
  close to the original BNF of the language, they are grammars in
  disguise. Models like this are difficult to obtain.  They would be
  the result of a model transformation from a high-level model.  Here,
  the intelligence would have to lie in the transformations."
- the crux of our approach is encapsulated in this passage: "How will
  this be represented in the model in a uniform fashion? One way is to
  have special metamodel-elements for print- ing text, and similarly
  for all the other library calls that differ; this also means changes
  to the metamodel if we want to include another call. The other way
  is to use a common runtime library that offers a uniform interface
  to the model and encapsulates differing functionality; clearly, this
  approach is superior."
- our approach is to make use of the standard libraries or third-party
  libraries available in languages but use templates and aspects as a
  way to fix the impedance mismatch. This saves us from having
  additional dependencies and makes programming more intuitive to the
  natives of a language. We can use the adoption paper as a rationale
  for why it is not a good idea to have a consistent API across
  languages.
- we need to explain why we wanted to support multiple
  languages. Reasons: 1) make sure we are not hard-coding the
  metamodel to just one language 2) expand the pool of contributors as
  much as possible.
- we created a level of abstraction from classes, modeling them
  according to the types: value objects, enumerations, etc.
- we do not support collections directly.
- we do not have a fixed type of primitives. We do split the notion of
  primitive and underlying primitive. This has to be explained in
  great detail. We do not have constraints on the presence of
  primitives, they are just handled like any other element.
- we do not support functions or operations.
- we use type mapping in order to create language agnostic models, and
  (will) support user overriding.
- our aims are also simple and readable code, using the language
  idioms at all times or high-level constructs such as patterns.
- our concept of system libraries and proxy libraries extends Piefel
  and Neumann's concepts of library interfaces. We need to explain this.

* Aspect-Oriented Model-Driven Software Product Line Engineering
  :PROPERTIES:
  :ID:       2184629c-a1de-4eed-b30d-9a0f3b951a76
  :END:

- [[file:papers/Aspect-Oriented%20Model-Driven%20Software%20Product%20Line%20Engineering.pdf][paper]]

