dogen/papers.html

<div id="outline-container-org517da62" class="outline-2">
<h2 id="org517da62"><span class="section-number-2">35</span> A Common Metamodel for Code Generation</h2>
<div class="outline-text-2" id="text-35">
<ul class="org-ul">
<li><a href="papers/A%20Common%20Metamodel%20for%20Code%20Generation.pdf">paper</a></li>
<li>very similar to previous paper.</li>
<li>We take a similar approach: "As has been outlined in [4], we use a
package with common meta- modelling building blocks for all our
metamodelling activities.  This makes it easier to speak about
common concepts under the same name, much as Design Patterns in
software engineering help programmers to talk about common
programming concepts."</li>
<li>they chose names similar to UML infrastructure; we have chosen names
that are different to ensure there is no confusion between language
concepts and modeling concepts, as well as not having problems with
reserved words.</li>
<li>they re-implemented UML infrastructure (parts of MOF that are in
UML?), and question whether to reuse it or re-implement it. We take
the view that whilst conceptually it is very useful, at the
implementation level it does not add any value.</li>
<li>there are differences between modeled languages (say namespaces /
packages); it is the role of the metamodel to normalise them and the
code generator to express them as idiomatically as possible.</li>
<li>we use the same approach of named elements, but we partitioned the
naming space.</li>
<li>they do not constrain elements to exist in packages; we more or less
do, although there are hacks to place things in the global
namespace. We need to clean this up.</li>
<li>due to normalisation (least common denominator) we also do not allow
multiple inheritance on data structures.</li>
<li>as the model is OO, there are limitations when modeling to non-OO
languages such as C. It is still possible though, and useful even
without support for operations.</li>
<li>we do not distinguish between collections at the metamodel
level. However, they link to aspects in the generator. At present we
do not support built-in collections (e.g. int[]). This is only
because the parsing engine does not parse them.</li>
<li>we do not model entry points such as main, etc at present. We could
in the future, but its better to simply bypass the dogen and create
files manually.</li>
<li>Java has package visibility, C# has internal visibility. Whilst we
do not have a way to model these, we could create the notion of
internal which in C++ means hide the header files and do not export
symbols. In C# use external. In java, ignore it.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb1293bd" class="outline-2">
<h2 id="orgb1293bd"><span class="section-number-2">36</span> A Code Generation Metamodel for ULF-Ware</h2>
<div class="outline-text-2" id="text-36">
<ul class="org-ul">
<li><a href="papers/A%20Code%20Generation%20Metamodel%20for%20ULF-Ware.pdf">paper</a></li>
<li>extremely interesting paper, which tackles exactly the same problem
as dogen: "While code can be generated from any model, we propose to
use an intermediate model that is tailored to code generation
instead. In order to be able to easily support different target
languages, this model should be general enough; in order to support
the whole process, the model has to contain behavioural as well as
structural aspects."</li>
<li>however, they seem to also focus on behaviour. Worth seeing what
they have to say, but we are explicitly moving away from it.</li>
<li>"Generally, adding another library with the same interface does not
require new transformations." Similar to Dogen, except we also cater
for impedance mismatches between metamodel and the library. For this
we use an aspect oriented approach, where feature configuration is
used to bind aspects to elements.</li>
<li>they have decided to use MOF as their metamodel.  We have used UML
to define our metamodel. We need a good explanation for our approach
given its a lot less orthodox. We did not find the MOF types useful
to our model. Need to justify this.</li>
<li>crucial quote, totally applicable to us: "High-level models are
quite different from programs in conventional programming
languages. They abstract from most of the detail that a programming
language exhibits. Once you want to generate real code, all this
detail has to be filled in. This makes code generation from those
models a difficult task. Moreover, many decisions in this process
are similar for different target languages, but it is hard to make
use of these commonalities." Our key objective was to design a model
that modeled these aspects.</li>
<li>very important point on "close to the language but not too close":
"The reverse approach is to use models that are very low-level and
close to a specific language. There have been a number of papers
such as [6] implement- ing this. The metamodel obtained this way is
close to the original BNF of the language, they are grammars in
disguise. Models like this are difficult to obtain.  They would be
the result of a model transformation from a high-level model.  Here,
the intelligence would have to lie in the transformations."</li>
<li>the crux of our approach is encapsulated in this passage: "How will
this be represented in the model in a uniform fashion? One way is to
have special metamodel-elements for print- ing text, and similarly
for all the other library calls that differ; this also means changes
to the metamodel if we want to include another call. The other way
is to use a common runtime library that offers a uniform interface
to the model and encapsulates differing functionality; clearly, this
approach is superior."</li>
<li>our approach is to make use of the standard libraries or third-party
libraries available in languages but use templates and aspects as a
way to fix the impedance mismatch. This saves us from having
additional dependencies and makes programming more intuitive to the
natives of a language. We can use the adoption paper as a rationale
for why it is not a good idea to have a consistent API across
languages.</li>
<li>we need to explain why we wanted to support multiple
languages. Reasons: 1) make sure we are not hard-coding the
metamodel to just one language 2) expand the pool of contributors as
much as possible.</li>
<li>we created a level of abstraction from classes, modeling them
according to the types: value objects, enumerations, etc.</li>
<li>we do not support collections directly.</li>
<li>we do not have a fixed type of primitives. We do split the notion of
primitive and underlying primitive. This has to be explained in
great detail. We do not have constraints on the presence of
primitives, they are just handled like any other element.</li>
<li>we do not support functions or operations.</li>
<li>we use type mapping in order to create language agnostic models, and
(will) support user overriding.</li>
<li>our aims are also simple and readable code, using the language
idioms at all times or high-level constructs such as patterns.</li>
<li>our concept of system libraries and proxy libraries extends Piefel
and Neumann's concepts of library interfaces. We need to explain this.</li>
</ul>
</div>
</div>
