dogen/papers.org
** Expressing Variability in Structural Models

- reference to czarnecki's paper on superimposed variants: "In [13],
  the links are managed using stereotypes which requires invasive
  changes to the model that should be tailored." We need to add this
  to our list of disadvantages.
- our approach of splitting the generational model from the modeling
  model means that we do not have to worry about positive or negative
  variability in the modeling (structural) space (well, not entirely
  at any rate). Instead, it is (mostly) pushed down to the
  generation/templates level, where it is easier to handle. In a way,
  we disagree with Groher and Voelter's statements: "Variability can
  be described more concisely since in addition to the traditional
  mechanisms (e.g. patterns, frameworks, polymorphism), variability
  can be described on the more abstract level of models." Our
  generation model provides us a set of dimensions under which a model
  can vary so that handling variability at the implementation level
  becomes more manageable.
- we moved towards the world of facets for exactly the same reason
  that M2T has moved towards templates: it is the right mix of
  abstraction and hard-coding. Somethings are just too verbose to
  describe at the model level, such as serialisation. However, this
  may be an artefact of our main target language (C++), because on
  other languages such as C# we probably would rely more on aspects
  and less on facets.
- modeling space has a mapping from problem space to solution space. A
  solution space model in a different representation will have a one
  to one mapping to modeling space.
- we specifically remove the ability to handle positive/negative
  variability in the structural model to reduce complexity.
- conclusion: we have limited support for structural variability, by
  design. Or perhaps, we use structural variability only in one place,
  and that is going from frontend models into the modeling
  model. However, the variability is mainly concerned with type
  mapping rather than proper variability (positive/negative). This is
  still structural variability though since the modeling model will
  _vary_ according to the feature configuration selected by the user,
  which is conveyed via UML facilities: stereotypes and tagged values.
  Yet another take is that we use negative variability everywhere, but
  it does not have a structural manifestation due to the
  modeling/generation space split. In other words, users can switch
  off facets (negative variability) but since facets do not have a
  structural representation at the modeling level you cannot see
  it. But this is clearly negative variability.

** Expressing Variability in Model Transformations

- the code generation feature model is expressed as code, and can be
  queried by the model transformations. The model transformations are
  hard-coded to the generation model, and are designed to provide all
  the required queries. Extensions to queries requires changes to both
  the metamodel and the transformations.
- we only support one type of cross-metamodel transform: from frontend
  metamodel to modeling metamodel.
- most of our transforms are "in place transforms", called model
  modifications rather than model transformations; that is, the
  original model is modified. A few transforms such as merging do not
  touch the inputs, so these are proper transforms. We need to explain
  that we treat modifications and transforms the same way.
- we code-generate the feature model, but every time a new feature is
  added we need to manually update the affected transforms. This is
  done to keep code generation easy to understand. Note that this is
  feasible because this is not a general purpose code generator but a
  special purpose code generator.

** Expressing Variability in Code Generation Templates

- As with transformation, we access the feature model directly and
  changes must be done manually.
- we use stitch and stitch2 to generate regular c++ code that is human
  readable, debuggable etc. Developers do not need to learn a new
  toolset.
- we use AO for handling variability just for one case: helpers. The
  objective is to reduce the amount of third party code needed to
  solve the impedance mismatch between generated code and supporting
  libraries. The rest is handled by hard-coding the code generator
  feature model into the templates. This is done by design.
- we could use "feature casting": create a base class for features (or
  feature groups, check terminology). Users request the feature (or
  group) via its path, and the template function takes a type
  parameter for the casting. It could return an optional, if the
  feature is optional.Annoyingly this is not required for "core"
  features because we can see the type definition, but if we use this
  pattern everywhere, it means users can add their own features,
  register them, and consume them from their templates.

** Expressing Variability in Code

- mainly by use of apsects and integrating them with the feature
  model. Use of comments allows code generator to remove code that is
  not required. Interestingly, this could be done via our proposed
  merging approach: protected regions could be annotated with
  additional attributes, and these could be linked to features. During
  generation we could not express the protected regions for which the
  features have not been switched on. However, we do not have a use
  case for this. Also its not clear where the protected regions would
  be stored - the code generation product line vs software product
  line split is a bit confusing.

