dogen/papers.org
** Home Automation Case Study

- it is still not clear why we need to resort to DSLs in order to
  create unique products when we could just as well treat each product
  in a product line as data and have rules for specific
  configurations. This seems to be the case with the home automation.
- in addition, the PIM to PSM transformation, could also be thought of
  as parameterisation in variability space. That is, we could simply
  have a set of mappings that determine platform specific
  implementations (component technology, programming language, etc)
  which are chosen by the user (via feature configuration). Then, we
  go from PIM directly to code. This simplistic approach is more
  adequate to new MDE users. The PIM to PSM options are canned, but
  extensible, the hard-way: add your own plugin, provide a new facet,
  select it on your feature configuration.
- orthogonal variability: variability which is not dependent on to the
  problem space model instance - e.g. applies regardless of the
  specific configuration. "By orthogonal we mean variability that
  affects multiple domain entities and their subsequent processing
  (i.e. transformation) steps."
- reflection layer seems to be useful to generate a GUI at
  runtime. However, it seems easier to map GUI elements at generation
  time, and then determine which dialogues are available in the UI
  depending on the presence of elements of the problem space model.
- configurative variability: this seems to be the technical term for
  using data to manage variability. Our approach is to push a lot of
  structural variability into configurative variability, so that the
  end users of the system need to deal with it rather than the
  developers. Actually, configurative variability can be realised by
  structural variability.
- "The higher the abstraction level is, the fewer variation points
  exist. Features expressed on models level are thus inherently
  simpler than features expressed on code generation level. We
  therefore argue to always express features on the highest possible
  level."

** Conclusions

- "The higher the abstraction level is, the fewer variation points
  exist. Features expressed on models level are thus inherently
  simpler than features expressed on code generation level. We
  therefore argue to always express features on the highest possible
  level." - however, there is still a trade-off: by expressing
  features in the model and producing structural transformations, we
  then push the complexity to the transforms and templates. We should
  distinguish between features that have a good structural
  representation from features that are trivial functions of structure
  such as serialisation, test data generation, etc. For these, it
  makes more sense not to represent them structurally but instead have
  the variation points expressed at the template level.
- this raises an interesting point:

* An Aspect-Oriented and Model-Driven Approach for Managing Dynamic Variability
  :PROPERTIES:
  :ID:       643b1ad0-e48b-4b3a-a205-64af900378f8
  :END:

- [[file:papers/An%20Aspect-Oriented%20and%20Model-Driven%20Approach%20for%20Managing%20Dynamic%20Variability.pdf][paper]]
- describes a framework to dynamically generate valid
  configurations.
- uses a metamodel to describe AOM, allowing the application of
  aspects dynamically to a model (called SMART ADAPTERS)
- computes diff and match models and then based on that outputs a
  configuration. The configuration can then be validated before its
  applied. All of this is done at run time so for systems where
  configuration transitions need to be quick (or predictable), this is
  not suitable out of the box. They suggest pre-computing critical
  configurations up front (at startup?)
- does not seem to be directly applicable to Dogen: the code generator
  itself does not have a need for "discovery". Applications built with
  it may have such a need, but its not obvious creating a reflection
  based mechanism, plus AOM etc is the most straightforward way of
  handling this. We need a specific use case in order to frame this
  paper.
- in general, we do not have a requirement for dynamic
  variability. Well, we do but it is handled via plugins etc. We have
  a limited requirement for this. Our aim is to reduce the variability
  surface area so that we reduce the complexity associated with
  handling it.

* A Feature Model for Model-to-Text Transformation Languages
  :PROPERTIES:
  :ID:       10533850-b1f4-497a-ad11-dee38d3d7f15
  :END:

** Abstract

- it seems like the main contribution of this paper is a feature model
  for M2T languages. This is useful so we can justify out choices in
  Stitch2.

** Introduction

- migrating M2T languages is very difficult. Effectively its a form of
  vendor lock-in. Its easier to just rewrite than to port.
- most M2T languages are template based. There are other types though
  (visitor pattern based, explicit printing of statements). Paper only
  focuses on template based.
- their paper helps users that want to select a M2T language.

** A Feature Model for M2T Languages

- Their work is largely based on Czarnecki and Helsen's, but they
  considered template based M2T a degenerate case whereas Rose etal
  consider it the most significant case.
- they use FeatureIDE to draw their feature diagrams. It is eclipse
  based.
- transformation style: imperative or declarative.
- templates: direction of escaping (is the code escaped or is the
  template escaped), typed templating language, textual templating
  language.
- output: destination of the output - normally to file?
  post-processing: clang format, protected region handling.
- modularity mechanisms: template reuse. Here we provide only a single
  way of reusing a template, the aspect approach. The idea is that for
  specific types we may need to inject additional functionality. This
  is not meant as a generic reuse mechanism, instead for this users
  should use copy & paste.
- tracing: how to relate the template to the generated code. Note that
  we are not talking about the transformation from template into C++
  code capable of generating a file, but the end file. Its as if we
  need two levels of tracing here.
- incrementality: the way the transformation is executed in response
  to changes to the source model. Ideally we should have a separation
  between the internal generation of the code and the updating of
  files in the file system.
- directionality: normally uni-directional, e.g. from model to text.
- tools: not clear, does not include IDE with syntax highlighting and
  debugging.

* Modeling Variability in Template-based Code Generators for Product Line Engineering
  :PROPERTIES:
  :ID:       d5135a6d-14b8-4e8e-9c84-e1461cdddf3f
  :END:

- [[file:papers/Modeling%20variability%20in%20template-based%20code%20generators%20for%20product%20line%20engineering.pdf][paper]]
- how to model variability using Variability Regions instead of Aspect
  Oriented Programing.

