dogen/papers.html

<div id="outline-container-orgf775cf6" class="outline-3">
<h3 id="orgf775cf6"><span class="section-number-3">40.1</span> Abstract</h3>
<div class="outline-text-3" id="text-40-1">
<ul class="org-ul">
<li>we need to define what is meant by variant.</li>
<li>what is meant by "adaptable and extensible"? What are the dimensions
under which we "adapt and extend"?</li>
<li>authors are critical, but being fixed to a set of features is not
necessarily a bad thing, if there is good support out of the box.</li>
<li>the key point seems to be a mapping of features to Variability
Regions (VRs), and having dependency management amongst VRs.</li>
<li>we need a good discussion on why VRs are better than aspects, and
how they relate.</li>
</ul>
</div>
</div>

<div id="outline-container-org3390b34" class="outline-3">
<h3 id="org3390b34"><span class="section-number-3">40.2</span> Introduction</h3>
<div class="outline-text-3" id="text-40-2">
<ul class="org-ul">
<li>paper is critical of monolithic code generators, but there are
advantages; they are a lot simpler. Also, its important to think of
reuse as a dimensional space. We can facilitate some kinds of reuse
whilst precluding others in the search for lowering complexity.</li>
<li>interestingly, they seem to imply that both Acceleo and Xtend have
an approach of handling variability which relies on "language
specific approaches for implementing variability, e.g. design
patterns." This ties in with the <a href="papers/Handling%20Variability%20in%20Model%20Transformations%20and%20Generators.pdf">Voelter paper</a>.</li>
<li>the paper focuses on Code Generator Product Lines, designed
specifically to handle variability in code generators. Their
approach is based on Variability Regions and they state that these
can be applied to any code generator.</li>
<li>layers are an extension of the feature oriented programming (FOP)
concept, applied to code generation templates. They define how
parts of a template or an entire template can be resued within
layers. The key point is to decouple the concepts from the template
technology, so that they can be applied to any code generator. This
seems extremely useful for Dogen.</li>
</ul>
</div>
</div>

<div id="outline-container-org8576a0b" class="outline-3">
<h3 id="org8576a0b"><span class="section-number-3">40.3</span> Variability Concepts in Code Generator Product Lines</h3>
<div class="outline-text-3" id="text-40-3">
<ul class="org-ul">
<li>we are creating a Code Generator Product Line (CGPL). This is quite
confusing. Basically we do not give end users a code generator; we
give them a "template" with which to create specific code generators
for their use case. The customisation of the code generator is done
via the variability mechanisms we make available to them, which at
present are:
<ul class="org-ul">
<li>structural: object templates, stereotypes such as visitor,
enumeration etc.</li>
<li>non-structural: all of the dogen machinery to customise a model
such as adding licences, comments on or off (not yet implemented),
enabling of facets, etc.  When we finally implement "profiles" on
top of stereotypes, this will also be a non-structural mechanism,
even though it spans structure (users define classes, which are
associated with stereotype (the class name) and toggle features
on/off).</li>
</ul></li>
<li>a concrete code generator product is called a Variant. A CGPL is
like a Software Product Line (SPL) factory, because it generates
concrete code generators. These then generate SPLs?</li>
<li>FOP is an approach to implement SPLs that is based on building
software systems by composing features. A feature represents a
configurable unit of a software system that represents a
requirement-satisfying design decision. Features are arranged in
layers that contain artefacts. These artefacts appear to be
templates. Artefacts may refine multiple other artefacts. However,
it seems the paper puts java classes and layers on the same
plane. It seems they make the distinction between "code generated
artefacts" and others. Code generator layers are used for code
generator artefacts.</li>
<li>also, its not obvious why we need both VRs and layers. We could
simply say that a template is made up of a set of VRs, and the VRs
are switched on or off based on feature configuration. This is
slightly better than AOP because we don't need all of the AOP
machinery (cross-cutting concerns, joint points, etc).</li>
<li>if we map this model to Dogen, a stitch template becomes an
artefact, and helpers then provide a way to "compose"
templates. Facets "map" the feature (e.g. boost serialisation) to
the artefact (e.g. template implementing boost serialisation). We
have transported the feature configuration into the code generation
metamodel and the assistant by adding generation specific types to
it: <code>requires_hashing_helper</code> etc. The key problem is that in Dogen
we do not have a concept of Variability Regions nor will it be easy
to implement because it would require dramatic changes to
stitch. Also the "conditions" for each VR can be quite complex. Its
not clear what advantages we'd gain from VRs in Dogen. The
addressability of VRs is quite interesting, but not clear how we'd
make use of it to improve things. We could possibly make a
description of the model of the template as a set of named
variability regions with associated predicates, but then explain
that implementation-wise, its more sensible to code it by hand given
the target audience.</li>
<li>we need to have a section on "informal reuse" / copy and paste reuse.</li>
<li>we need to do a write up of why we think that the increase in
complexity by having a layer/feature DSL is not a good fit for an
entry-level code generator product line. We need to make the case
for keeping templates quite close to regular code.</li>
<li>interesting paper: <a href="https://link.springer.com/book/10.1007%252F978-3-642-37521-7">Feature-Oriented Software Product Lines: Concepts
and Implementation</a>. However seems to be behind a paywall.</li>
<li>commands in layer DSL: define a layer, VR replaces other VR, appears
before or after a VR.</li>
</ul>
</div>
</div>
