dogen/papers.org
** Code Generator Variant Configuration and Generation

- a CGPL consists of a number of layers, and each layer contains a
  number of templates.
- their approach works more like a library, where concrete CGPL reuse
  the basic infrastructure to create the specific CGPL the user is
  interested in. This allows for both a high degree of reuse and a
  high degree of configurability. The downside is complexity, because
  the user needs to understand two DSLs.
- Layer Definition Language (LDL) is the DSL created to model the
  layer operations.
- variant configuration: we need to ensure the set of layers generates
  a valid configuration. They use a coloured graph to do this. The
  graph must be acyclic, and they do not support multiple
  inheritance. We could probably use a similar approach for features.
- in their case: "based on the layer definition model and the product
  configuration model, a concrete code generation variant is created."
  In our case, this is done at dogen run time. Code generator variants
  are a function of the product configuration model which is embedded
  in the structural model. Variation is constrained in order to
  achieve this. Composition / layering is achieved not at the template
  level but at the facet level. Actually perhaps what we are saying is
  that facets are the layers and we explicitly move them away from the
  template / file level to tame complexity. We make use of a fixed set
  of layers but we use them at a higher conceptual level. Variability
  Regions are no longer required at the layer level - we vary by the
  entire layer at this level. We can then make an argument for a) why
  layers at the artefact level is the wrong approach if you are
  optimising to reduce complexity b) the downside of losing some
  object orientation by moving responsibility across to other classes,
  not a problem in hybrid languages like C++ or procedural languages
  like C but a problem in Java/C#.
- in this case we can then say we use exactly the same approach for
  the creation of concrete variants (e.g. coloured graph). We need to
  also add how we allow variation at the metamodel element instance
  level.
- transitivity is an issue for layers as is an issue for facets. We
  need to reuse their approach.
- the run time of the code generator is called generation time. All
  our operations are executed at generation time. Perhaps we should
  name our variants generation time variants.
- we need to make a case for stitch as a template language very close
  to a general purpose language. We need to compare it to Xpand.

** Demonstrating Example for Variability Regions

- terminology: we describe templates as "archetypes" whereas they seem
  to call them artefacts (or somehow artefacts are related to
  templates). In our model, empty VRs do not make sense nor do empty
  layers. We have multiple archetypes to express a given
  metatype. These form layers (e.g. what we called facets).
- the problem with using comments to mark VRs are mentioned, and they
  seem to be exactly the same as with protected regions.
- Xpand's way of allowing method definitions "out of order" makes
  templates much harder to read - e.g. to visualise what the output of
  the template will be.

** Industrial Case Study

- generation of inner classes: this can be handled easily by metadata
  and using namespaced names on the structural representation.
- classes tagged with a stereotype instead of generating regular
  fields, generate "special" fields.
- suffixes added to class names: this should be a metadata parameter
  to the code generator.
- their research questions are very good, and very measurable. The
  approach of doing "old way" and "new way" and comparing the results
  is very effective. Its not so easy for us to do this, but if we
  could it would be a major selling point.
- we need to somehow state that our approach allows a large number of
  CGPL to be generated via generation time configuration without any
  need to copy & paste reuse nor the complexity of a general purpose
  VR mechanism. If we could find a project that is already using say
  EMF and prove that with just our code generator out of the box (plus
  minor alterations) we could generate the same code we would have
  "proof".

** Related Work

- here they provide a taxonomy of approaches to express variability in
  the solution space. We need to classify our approach against these:
  - annotative: specify all variants in one model.
  - compositional: combine different model fragments to derive a
    specific variant.
  - delta modeling: applies transformations to a core model
- these approaches seem to overlap with Positive and Negative
  variability.
- dogen seems to use a combination of annotational (metadata tags) and
  compositional (profiles are defined separately). Once we move
  profiles into the models, these become annotational.
- seems important to have the concept of VRs at the template level.
- we seemed to have followed the Groher approach by handling all
  structural differences on model level by the transformation
  layer. We should discuss this.
- we explicitly do not allow dynamic overriding of parts of a
  template, but allow users to override an entire layer (e.g. facet)
  with their own implementation located somewhere else in generation
  space (actually it could also be in the same location in space, but
  we need some handling to give higher priority of user templates over
  system templates). In this sense we have copied the acceleo
  approach, but we do so by generating a DLL and injecting it to the
  code generator. This generates further CGPLs. Users can create
  templates via the copy & paste reuse. However, we strongly suggest
  this as the last case scenario, when a user has very specific
  requirements which cannot be reconciled with the majority of the
  user base.
