dogen/papers.html

<div id="outline-container-orgec61f0f" class="outline-3">
<h3 id="orgec61f0f"><span class="section-number-3">40.4</span> Code Generator Variant Configuration and Generation</h3>
<div class="outline-text-3" id="text-40-4">
<ul class="org-ul">
<li>a CGPL consists of a number of layers, and each layer contains a
number of templates.</li>
<li>their approach works more like a library, where concrete CGPL reuse
the basic infrastructure to create the specific CGPL the user is
interested in. This allows for both a high degree of reuse and a
high degree of configurability. The downside is complexity, because
the user needs to understand two DSLs.</li>
<li>Layer Definition Language (LDL) is the DSL created to model the
layer operations.</li>
<li>variant configuration: we need to ensure the set of layers generates
a valid configuration. They use a coloured graph to do this. The
graph must be acyclic, and they do not support multiple
inheritance. We could probably use a similar approach for features.</li>
<li>in their case: "based on the layer definition model and the product
configuration model, a concrete code generation variant is created."
In our case, this is done at dogen run time. Code generator variants
are a function of the product configuration model which is embedded
in the structural model. Variation is constrained in order to
achieve this. Composition / layering is achieved not at the template
level but at the facet level. Actually perhaps what we are saying is
that facets are the layers and we explicitly move them away from the
template / file level to tame complexity. We make use of a fixed set
of layers but we use them at a higher conceptual level. Variability
Regions are no longer required at the layer level - we vary by the
entire layer at this level. We can then make an argument for a) why
layers at the artefact level is the wrong approach if you are
optimising to reduce complexity b) the downside of losing some
object orientation by moving responsibility across to other classes,
not a problem in hybrid languages like C++ or procedural languages
like C but a problem in Java/C#.</li>
<li>in this case we can then say we use exactly the same approach for
the creation of concrete variants (e.g. coloured graph). We need to
also add how we allow variation at the metamodel element instance
level.</li>
<li>transitivity is an issue for layers as is an issue for facets. We
need to reuse their approach.</li>
<li>the run time of the code generator is called generation time. All
our operations are executed at generation time. Perhaps we should
name our variants generation time variants.</li>
<li>we need to make a case for stitch as a template language very close
to a general purpose language. We need to compare it to Xpand.</li>
</ul>
</div>
</div>

<div id="outline-container-org5bd4da5" class="outline-3">
<h3 id="org5bd4da5"><span class="section-number-3">40.5</span> Demonstrating Example for Variability Regions</h3>
<div class="outline-text-3" id="text-40-5">
<ul class="org-ul">
<li>terminology: we describe templates as "archetypes" whereas they seem
to call them artefacts (or somehow artefacts are related to
templates). In our model, empty VRs do not make sense nor do empty
layers. We have multiple archetypes to express a given
metatype. These form layers (e.g. what we called facets).</li>
<li>the problem with using comments to mark VRs are mentioned, and they
seem to be exactly the same as with protected regions.</li>
<li>Xpand's way of allowing method definitions "out of order" makes
templates much harder to read - e.g. to visualise what the output of
the template will be.</li>
</ul>
</div>
</div>

<div id="outline-container-org752cdc6" class="outline-3">
<h3 id="org752cdc6"><span class="section-number-3">40.6</span> Industrial Case Study</h3>
<div class="outline-text-3" id="text-40-6">
<ul class="org-ul">
<li>generation of inner classes: this can be handled easily by metadata
and using namespaced names on the structural representation.</li>
<li>classes tagged with a stereotype instead of generating regular
fields, generate "special" fields.</li>
<li>suffixes added to class names: this should be a metadata parameter
to the code generator.</li>
<li>their research questions are very good, and very measurable. The
approach of doing "old way" and "new way" and comparing the results
is very effective. Its not so easy for us to do this, but if we
could it would be a major selling point.</li>
<li>we need to somehow state that our approach allows a large number of
CGPL to be generated via generation time configuration without any
need to copy &amp; paste reuse nor the complexity of a general purpose
VR mechanism. If we could find a project that is already using say
EMF and prove that with just our code generator out of the box (plus
minor alterations) we could generate the same code we would have
"proof".</li>
</ul>
</div>
</div>

<div id="outline-container-org1ed7d14" class="outline-3">
<h3 id="org1ed7d14"><span class="section-number-3">40.7</span> Related Work</h3>
<div class="outline-text-3" id="text-40-7">
<ul class="org-ul">
<li>here they provide a taxonomy of approaches to express variability in
the solution space. We need to classify our approach against these:
<ul class="org-ul">
<li>annotative: specify all variants in one model.</li>
<li>compositional: combine different model fragments to derive a
specific variant.</li>
<li>delta modeling: applies transformations to a core model</li>
</ul></li>
<li>these approaches seem to overlap with Positive and Negative
variability.</li>
<li>dogen seems to use a combination of annotational (metadata tags) and
compositional (profiles are defined separately). Once we move
profiles into the models, these become annotational.</li>
<li>seems important to have the concept of VRs at the template level.</li>
<li>we seemed to have followed the Groher approach by handling all
structural differences on model level by the transformation
layer. We should discuss this.</li>
<li>we explicitly do not allow dynamic overriding of parts of a
template, but allow users to override an entire layer (e.g. facet)
with their own implementation located somewhere else in generation
space (actually it could also be in the same location in space, but
we need some handling to give higher priority of user templates over
system templates). In this sense we have copied the acceleo
approach, but we do so by generating a DLL and injecting it to the
code generator. This generates further CGPLs. Users can create
templates via the copy &amp; paste reuse. However, we strongly suggest
this as the last case scenario, when a user has very specific
requirements which cannot be reconciled with the majority of the
user base.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-02-28 Sun 11:20</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
